export const collectAddress = {
    'province': [
      {
        'city': [
          {
            'county': [
              {
                'code': '110101',
                'name': '东城区'
              },
              {
                'code': '110102',
                'name': '西城区'
              },
              {
                'code': '110103',
                'name': '崇文区'
              },
              {
                'code': '110104',
                'name': '宣武区'
              },
              {
                'code': '110105',
                'name': '朝阳区'
              },
              {
                'code': '110106',
                'name': '丰台区'
              },
              {
                'code': '110107',
                'name': '石景山区'
              },
              {
                'code': '110108',
                'name': '海淀区'
              },
              {
                'code': '110109',
                'name': '门头沟区'
              },
              {
                'code': '110111',
                'name': '房山区'
              },
              {
                'code': '110112',
                'name': '通州区'
              },
              {
                'code': '110113',
                'name': '顺义区'
              },
              {
                'code': '110114',
                'name': '昌平区'
              },
              {
                'code': '110115',
                'name': '大兴区'
              },
              {
                'code': '110116',
                'name': '怀柔区'
              },
              {
                'code': '110117',
                'name': '平谷区'
              },
              {
                'code': '110228',
                'name': '密云县'
              },
              {
                'code': '110229',
                'name': '延庆县'
              },
              {
                'code': '110230',
                'name': '其它区'
              }
            ],
            'code': '110100',
            'name': '北京市',
            'cityClass': '1'
          }
        ],
        'code': '110000',
        'name': '北京'
      },
      {
        'city': [
          {
            'county': [
              {
                'code': '120101',
                'name': '和平区'
              },
              {
                'code': '120102',
                'name': '河东区'
              },
              {
                'code': '120103',
                'name': '河西区'
              },
              {
                'code': '120104',
                'name': '南开区'
              },
              {
                'code': '120105',
                'name': '河北区'
              },
              {
                'code': '120106',
                'name': '红桥区'
              },
              {
                'code': '120107',
                'name': '塘沽区'
              },
              {
                'code': '120108',
                'name': '汉沽区'
              },
              {
                'code': '120109',
                'name': '大港区'
              },
              {
                'code': '120110',
                'name': '东丽区'
              },
              {
                'code': '120111',
                'name': '西青区'
              },
              {
                'code': '120112',
                'name': '津南区'
              },
              {
                'code': '120113',
                'name': '北辰区'
              },
              {
                'code': '120114',
                'name': '武清区'
              },
              {
                'code': '120115',
                'name': '宝坻区'
              },
              {
                'code': '120221',
                'name': '宁河县'
              },
              {
                'code': '120223',
                'name': '静海县'
              },
              {
                'code': '120225',
                'name': '蓟县'
              },
              {
                'code': '120226',
                'name': '其它区'
              }
            ],
            'code': '120100',
            'name': '天津市',
            'cityClass': '1'
          }
        ],
        'code': '120000',
        'name': '天津'
      },
      {
        'city': [
          {
            'county': [
              {
                'code': '130102',
                'name': '长安区'
              },
              {
                'code': '130103',
                'name': '桥东区'
              },
              {
                'code': '130104',
                'name': '桥西区'
              },
              {
                'code': '130105',
                'name': '新华区'
              },
              {
                'code': '130107',
                'name': '井陉矿区'
              },
              {
                'code': '130108',
                'name': '裕华区'
              },
              {
                'code': '130121',
                'name': '井陉县'
              },
              {
                'code': '130123',
                'name': '正定县'
              },
              {
                'code': '130124',
                'name': '栾城县'
              },
              {
                'code': '130125',
                'name': '行唐县'
              },
              {
                'code': '130126',
                'name': '灵寿县'
              },
              {
                'code': '130127',
                'name': '高邑县'
              },
              {
                'code': '130128',
                'name': '深泽县'
              },
              {
                'code': '130129',
                'name': '赞皇县'
              },
              {
                'code': '130130',
                'name': '无极县'
              },
              {
                'code': '130131',
                'name': '平山县'
              },
              {
                'code': '130132',
                'name': '元氏县'
              },
              {
                'code': '130133',
                'name': '赵县'
              },
              {
                'code': '130181',
                'name': '辛集市'
              },
              {
                'code': '130182',
                'name': '藁城市'
              },
              {
                'code': '130183',
                'name': '晋州市'
              },
              {
                'code': '130184',
                'name': '新乐市'
              },
              {
                'code': '130185',
                'name': '鹿泉市'
              },
              {
                'code': '130186',
                'name': '其它区'
              }
            ],
            'code': '130100',
            'name': '石家庄市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '130202',
                'name': '路南区'
              },
              {
                'code': '130203',
                'name': '路北区'
              },
              {
                'code': '130204',
                'name': '古冶区'
              },
              {
                'code': '130205',
                'name': '开平区'
              },
              {
                'code': '130207',
                'name': '丰南区'
              },
              {
                'code': '130208',
                'name': '丰润区'
              },
              {
                'code': '130223',
                'name': '滦县'
              },
              {
                'code': '130224',
                'name': '滦南县'
              },
              {
                'code': '130225',
                'name': '乐亭县'
              },
              {
                'code': '130227',
                'name': '迁西县'
              },
              {
                'code': '130229',
                'name': '玉田县'
              },
              {
                'code': '130230',
                'name': '唐海县'
              },
              {
                'code': '130281',
                'name': '遵化市'
              },
              {
                'code': '130283',
                'name': '迁安市'
              },
              {
                'code': '130284',
                'name': '其它区'
              }
            ],
            'code': '130200',
            'name': '唐山市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '130302',
                'name': '海港区'
              },
              {
                'code': '130303',
                'name': '山海关区'
              },
              {
                'code': '130304',
                'name': '北戴河区'
              },
              {
                'code': '130321',
                'name': '青龙满族自治县'
              },
              {
                'code': '130322',
                'name': '昌黎县'
              },
              {
                'code': '130323',
                'name': '抚宁县'
              },
              {
                'code': '130324',
                'name': '卢龙县'
              },
              {
                'code': '130399',
                'name': '经济技术开发区'
              },
              {
                'code': '130398',
                'name': '其它区'
              }
            ],
            'code': '130300',
            'name': '秦皇岛市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '130402',
                'name': '邯山区'
              },
              {
                'code': '130403',
                'name': '丛台区'
              },
              {
                'code': '130404',
                'name': '复兴区'
              },
              {
                'code': '130406',
                'name': '峰峰矿区'
              },
              {
                'code': '130421',
                'name': '邯郸县'
              },
              {
                'code': '130423',
                'name': '临漳县'
              },
              {
                'code': '130424',
                'name': '成安县'
              },
              {
                'code': '130425',
                'name': '大名县'
              },
              {
                'code': '130426',
                'name': '涉县'
              },
              {
                'code': '130427',
                'name': '磁县'
              },
              {
                'code': '130428',
                'name': '肥乡县'
              },
              {
                'code': '130429',
                'name': '永年县'
              },
              {
                'code': '130430',
                'name': '邱县'
              },
              {
                'code': '130431',
                'name': '鸡泽县'
              },
              {
                'code': '130432',
                'name': '广平县'
              },
              {
                'code': '130433',
                'name': '馆陶县'
              },
              {
                'code': '130434',
                'name': '魏县'
              },
              {
                'code': '130435',
                'name': '曲周县'
              },
              {
                'code': '130481',
                'name': '武安市'
              },
              {
                'code': '130482',
                'name': '其他区'
              }
            ],
            'code': '130400',
            'name': '邯郸市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '130521',
                'name': '邢台县'
              },
              {
                'code': '130524',
                'name': '柏乡县'
              },
              {
                'code': '130528',
                'name': '宁晋县'
              },
              {
                'code': '130531',
                'name': '广宗县'
              },
              {
                'code': '130535',
                'name': '临西县'
              },
              {
                'code': '130502',
                'name': '桥东区'
              },
              {
                'code': '130503',
                'name': '桥西区'
              },
              {
                'code': '130522',
                'name': '临城县'
              },
              {
                'code': '130523',
                'name': '内丘县'
              },
              {
                'code': '130525',
                'name': '隆尧县'
              },
              {
                'code': '130526',
                'name': '任县'
              },
              {
                'code': '130527',
                'name': '南和县'
              },
              {
                'code': '130529',
                'name': '巨鹿县'
              },
              {
                'code': '130530',
                'name': '新河县'
              },
              {
                'code': '130532',
                'name': '平乡县'
              },
              {
                'code': '130533',
                'name': '威县'
              },
              {
                'code': '130534',
                'name': '清河县'
              },
              {
                'code': '130581',
                'name': '南宫市'
              },
              {
                'code': '130582',
                'name': '沙河市'
              },
              {
                'code': '130583',
                'name': '其他区'
              }
            ],
            'code': '130500',
            'name': '邢台市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '130604',
                'name': '南市区'
              },
              {
                'code': '130623',
                'name': '涞水县'
              },
              {
                'code': '130626',
                'name': '定兴县'
              },
              {
                'code': '130630',
                'name': '涞源县'
              },
              {
                'code': '130633',
                'name': '易县'
              },
              {
                'code': '130636',
                'name': '顺平县'
              },
              {
                'code': '130682',
                'name': '定州市'
              },
              {
                'code': '130698',
                'name': '高开区'
              },
              {
                'code': '130602',
                'name': '新市区'
              },
              {
                'code': '130603',
                'name': '北市区'
              },
              {
                'code': '130621',
                'name': '满城县'
              },
              {
                'code': '130622',
                'name': '清苑县'
              },
              {
                'code': '130624',
                'name': '阜平县'
              },
              {
                'code': '130625',
                'name': '徐水县'
              },
              {
                'code': '130627',
                'name': '唐县'
              },
              {
                'code': '130628',
                'name': '高阳县'
              },
              {
                'code': '130629',
                'name': '容城县'
              },
              {
                'code': '130631',
                'name': '望都县'
              },
              {
                'code': '130632',
                'name': '安新县'
              },
              {
                'code': '130634',
                'name': '曲阳县'
              },
              {
                'code': '130635',
                'name': '蠡县'
              },
              {
                'code': '130637',
                'name': '博野县'
              },
              {
                'code': '130638',
                'name': '雄县'
              },
              {
                'code': '130681',
                'name': '涿州市'
              },
              {
                'code': '130683',
                'name': '安国市'
              },
              {
                'code': '130684',
                'name': '高碑店市'
              },
              {
                'code': '130699',
                'name': '其他区'
              }
            ],
            'code': '130600',
            'name': '保定市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '130702',
                'name': '桥东区'
              },
              {
                'code': '130721',
                'name': '宣化县'
              },
              {
                'code': '130724',
                'name': '沽源县'
              },
              {
                'code': '130727',
                'name': '阳原县'
              },
              {
                'code': '130730',
                'name': '怀来县'
              },
              {
                'code': '130733',
                'name': '崇礼县'
              },
              {
                'code': '130703',
                'name': '桥西区'
              },
              {
                'code': '130705',
                'name': '宣化区'
              },
              {
                'code': '130706',
                'name': '下花园区'
              },
              {
                'code': '130722',
                'name': '张北县'
              },
              {
                'code': '130723',
                'name': '康保县'
              },
              {
                'code': '130725',
                'name': '尚义县'
              },
              {
                'code': '130726',
                'name': '蔚县'
              },
              {
                'code': '130728',
                'name': '怀安县'
              },
              {
                'code': '130729',
                'name': '万全县'
              },
              {
                'code': '130731',
                'name': '涿鹿县'
              },
              {
                'code': '130732',
                'name': '赤城县'
              },
              {
                'code': '130734',
                'name': '其他区'
              }
            ],
            'code': '130700',
            'name': '张家口市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '130803',
                'name': '双滦区'
              },
              {
                'code': '130821',
                'name': '承德县'
              },
              {
                'code': '130824',
                'name': '滦平县'
              },
              {
                'code': '130826',
                'name': '丰宁满族自治县'
              },
              {
                'code': '130828',
                'name': '围场满族蒙古族自治县'
              },
              {
                'code': '130802',
                'name': '双桥区'
              }
            ],
            'code': '130800',
            'name': '承德市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '130902',
                'name': '新华区'
              },
              {
                'code': '130903',
                'name': '运河区'
              },
              {
                'code': '130921',
                'name': '沧县'
              },
              {
                'code': '130922',
                'name': '青县'
              },
              {
                'code': '130923',
                'name': '东光县'
              },
              {
                'code': '130924',
                'name': '海兴县'
              },
              {
                'code': '130925',
                'name': '盐山县'
              },
              {
                'code': '130926',
                'name': '肃宁县'
              },
              {
                'code': '130927',
                'name': '南皮县'
              },
              {
                'code': '130928',
                'name': '吴桥县'
              },
              {
                'code': '130929',
                'name': '献县'
              },
              {
                'code': '130930',
                'name': '孟村回族自治县'
              },
              {
                'code': '130981',
                'name': '泊头市'
              },
              {
                'code': '130982',
                'name': '任丘市'
              },
              {
                'code': '130983',
                'name': '黄骅市'
              },
              {
                'code': '130984',
                'name': '河间市'
              },
              {
                'code': '130985',
                'name': '其它区'
              }
            ],
            'code': '130900',
            'name': '沧州',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '131102',
                'name': '桃城区'
              },
              {
                'code': '131121',
                'name': '枣强县'
              },
              {
                'code': '131122',
                'name': '武邑县'
              },
              {
                'code': '131123',
                'name': '武强县'
              },
              {
                'code': '131124',
                'name': '饶阳县'
              },
              {
                'code': '131125',
                'name': '安平县'
              },
              {
                'code': '131126',
                'name': '故城县'
              },
              {
                'code': '131127',
                'name': '景县'
              },
              {
                'code': '131128',
                'name': '阜城县'
              },
              {
                'code': '131181',
                'name': '冀州市'
              },
              {
                'code': '131182',
                'name': '深州市'
              },
              {
                'code': '131183',
                'name': '其它区'
              }
            ],
            'code': '131100',
            'name': '衡水市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '131002',
                'name': '安次区'
              },
              {
                'code': '131003',
                'name': '广阳区'
              },
              {
                'code': '131022',
                'name': '固安县'
              },
              {
                'code': '131023',
                'name': '永清县'
              },
              {
                'code': '131024',
                'name': '香河县'
              },
              {
                'code': '131025',
                'name': '大城县'
              },
              {
                'code': '131026',
                'name': '文安县'
              },
              {
                'code': '131028',
                'name': '大厂回族自治县'
              },
              {
                'code': '131051',
                'name': '开发区'
              },
              {
                'code': '131052',
                'name': '燕郊经济技术开发区'
              },
              {
                'code': '131081',
                'name': '霸州市'
              },
              {
                'code': '131082',
                'name': '三河市'
              },
              {
                'code': '131083',
                'name': '其它区'
              }
            ],
            'code': '131000',
            'name': '廊坊市',
            'cityClass': '1'
          }
        ],
        'code': '130000',
        'name': '河北省'
      },
      {
        'city': [
          {
            'county': [
              {
                'code': '140105',
                'name': '小店区'
              },
              {
                'code': '140106',
                'name': '迎泽区'
              },
              {
                'code': '140107',
                'name': '杏花岭区'
              },
              {
                'code': '140108',
                'name': '尖草坪区'
              },
              {
                'code': '140109',
                'name': '万柏林区'
              },
              {
                'code': '140110',
                'name': '晋源区'
              },
              {
                'code': '140121',
                'name': '清徐县'
              },
              {
                'code': '140123',
                'name': '阳曲县'
              },
              {
                'code': '140123',
                'name': '娄烦县'
              },
              {
                'code': '140181',
                'name': '古交市'
              },
              {
                'code': '140182',
                'name': '其它区'
              }
            ],
            'code': '140100',
            'name': '太原市',
            'cityClass': '2'
          },
          {
            'code': '140200',
            'name': '大同市',
            'cityClass': '2'
          },
          {
            'code': '140300',
            'name': '阳泉市',
            'cityClass': '2'
          },
          {
            'code': '140400',
            'name': '长治市',
            'cityClass': '2'
          },
          {
            'code': '140500',
            'name': '晋城市',
            'cityClass': '2'
          },
          {
            'code': '140600',
            'name': '朔州市',
            'cityClass': '2'
          },
          {
            'code': '140700',
            'name': '晋中市',
            'cityClass': '2'
          },
          {
            'code': '140800',
            'name': '临汾市',
            'cityClass': '2'
          },
          {
            'code': '140900',
            'name': '吕粱市',
            'cityClass': '2'
          },
          {
            'code': '141100',
            'name': '运城市',
            'cityClass': '2'
          }
        ],
        'code': '140000',
        'name': '山西省'
      },
      {
        'city': [
          {
            'county': [
              {
                'code': '150121',
                'name': '土默特左旗'
              },
              {
                'code': '150102',
                'name': '新城区'
              },
              {
                'code': '150103',
                'name': '回民区'
              },
              {
                'code': '150104',
                'name': '玉泉区'
              },
              {
                'code': '150105',
                'name': '赛罕区'
              },
              {
                'code': '150122',
                'name': '托克托县'
              },
              {
                'code': '150123',
                'name': '和林格尔县'
              },
              {
                'code': '150125',
                'name': '武川县'
              },
              {
                'code': '150124',
                'name': '清水河县'
              },
              {
                'code': '150126',
                'name': '其它区'
              }
            ],
            'code': '150100',
            'name': '呼和浩特市',
            'cityClass': '2'
          },
          {
            'code': '150200',
            'name': '包头市',
            'cityClass': '2'
          },
          {
            'code': '150300',
            'name': '乌海市',
            'cityClass': '2'
          },
          {
            'code': '150400',
            'name': '赤峰市',
            'cityClass': '2'
          },
          {
            'code': '150500',
            'name': '通辽市',
            'cityClass': '2'
          },
          {
            'code': '150600',
            'name': '鄂尔多斯市',
            'cityClass': '2'
          },
          {
            'code': '150700',
            'name': '呼伦贝尔市',
            'cityClass': '2'
          },
          {
            'code': '150800',
            'name': '巴彦淖尔市',
            'cityClass': '2'
          },
          {
            'code': '150900',
            'name': '乌兰察布市',
            'cityClass': '2'
          }
        ],
        'code': '150000',
        'name': '内蒙古省'
      },
      {
        'city': [
          {
            'county': [
              {
                'code': '210102',
                'name': '和平区'
              },
              {
                'code': '210103',
                'name': '沈河区'
              },
              {
                'code': '210104',
                'name': '大东区'
              },
              {
                'code': '210105',
                'name': '皇姑区'
              },
              {
                'code': '210106',
                'name': '铁西区'
              },
              {
                'code': '210111',
                'name': '苏家屯区'
              },
              {
                'code': '210112',
                'name': '东陵区'
              },
              {
                'code': '210113',
                'name': '新城子区'
              },
              {
                'code': '210114',
                'name': '于洪区'
              },
              {
                'code': '210122',
                'name': '辽中县'
              },
              {
                'code': '210123',
                'name': '康平县'
              },
              {
                'code': '210124',
                'name': '法库县'
              },
              {
                'code': '210181',
                'name': '新民市'
              },
              {
                'code': '210182',
                'name': '浑南新区'
              },
              {
                'code': '210183',
                'name': '张士开发区'
              },
              {
                'code': '210184',
                'name': '沈北新区'
              },
              {
                'code': '210185',
                'name': '其它区'
              }
            ],
            'code': '210100',
            'name': '沈阳市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '210202',
                'name': '中山区'
              },
              {
                'code': '210203',
                'name': '西岗区'
              },
              {
                'code': '210204',
                'name': '沙河口区'
              },
              {
                'code': '210211',
                'name': '甘井子区'
              },
              {
                'code': '210212',
                'name': '旅顺口区'
              },
              {
                'code': '210213',
                'name': '金州区'
              },
              {
                'code': '210224',
                'name': '长海县'
              },
              {
                'code': '210251',
                'name': '开发区'
              },
              {
                'code': '210281',
                'name': '瓦房店市'
              },
              {
                'code': '210282',
                'name': '普兰店市'
              },
              {
                'code': '210283',
                'name': '庄河市'
              },
              {
                'code': '210297',
                'name': '岭前区'
              },
              {
                'code': '210298',
                'name': '其它区'
              }
            ],
            'code': '210200',
            'name': '大连市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '210302',
                'name': '铁东区'
              },
              {
                'code': '210304',
                'name': '立山区'
              },
              {
                'code': '210311',
                'name': '千山区'
              },
              {
                'code': '210323',
                'name': '岫岩满族自治县'
              },
              {
                'code': '210351',
                'name': '高新区'
              },
              {
                'code': '210303',
                'name': '铁西区'
              },
              {
                'code': '210321',
                'name': '台安县'
              },
              {
                'code': '210381',
                'name': '海城市'
              },
              {
                'code': '210382',
                'name': '其它区'
              }
            ],
            'code': '210300',
            'name': '鞍山市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '210402',
                'name': '新抚区'
              },
              {
                'code': '210404',
                'name': '望花区'
              },
              {
                'code': '210411',
                'name': '顺城区'
              },
              {
                'code': '210422',
                'name': '新宾满族自治县'
              },
              {
                'code': '210403',
                'name': '东洲区'
              },
              {
                'code': '210421',
                'name': '抚顺县'
              },
              {
                'code': '210423',
                'name': '清原满族自治县'
              },
              {
                'code': '210424',
                'name': '其它区'
              }
            ],
            'code': '210400',
            'name': '抚顺市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '210502',
                'name': '平山区'
              },
              {
                'code': '210503',
                'name': '溪湖区'
              },
              {
                'code': '210505',
                'name': '南芬区'
              },
              {
                'code': '210521',
                'name': '本溪满族自治县'
              },
              {
                'code': '210504',
                'name': '明山区'
              },
              {
                'code': '210522',
                'name': '桓仁满族自治县'
              },
              {
                'code': '210523',
                'name': '其它区'
              }
            ],
            'code': '210500',
            'name': '本溪市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '210602',
                'name': '元宝区'
              },
              {
                'code': '210604',
                'name': '振安区'
              },
              {
                'code': '210624',
                'name': '宽甸满族自治县'
              },
              {
                'code': '210682',
                'name': '凤城市'
              },
              {
                'code': '210603',
                'name': '振兴区'
              },
              {
                'code': '210681',
                'name': '东港市'
              },
              {
                'code': '210683',
                'name': '其它区'
              }
            ],
            'code': '210600',
            'name': '丹东市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '210702',
                'name': '古塔区'
              },
              {
                'code': '210703',
                'name': '凌河区'
              },
              {
                'code': '210711',
                'name': '太和区'
              },
              {
                'code': '210726',
                'name': '黑山县'
              },
              {
                'code': '210727',
                'name': '义县'
              },
              {
                'code': '210781',
                'name': '凌海市'
              },
              {
                'code': '210782',
                'name': '北镇市'
              },
              {
                'code': '210783',
                'name': '其它区'
              }
            ],
            'code': '210700',
            'name': '锦州市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '210802',
                'name': '站前区'
              },
              {
                'code': '210803',
                'name': '西市区'
              },
              {
                'code': '210804',
                'name': '鲅鱼圈区'
              },
              {
                'code': '210811',
                'name': '老边区'
              },
              {
                'code': '210881',
                'name': '盖州市'
              },
              {
                'code': '210882',
                'name': '大石桥市'
              },
              {
                'code': '210883',
                'name': '其它区'
              }
            ],
            'code': '210800',
            'name': '营口市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '210902',
                'name': '海州区'
              },
              {
                'code': '210903',
                'name': '新邱区'
              },
              {
                'code': '210904',
                'name': '太平区'
              },
              {
                'code': '210905',
                'name': '清河门区'
              },
              {
                'code': '210911',
                'name': '细河区'
              },
              {
                'code': '210921',
                'name': '阜新蒙古族自治县'
              },
              {
                'code': '210922',
                'name': '彰武县'
              },
              {
                'code': '210923',
                'name': '其它区'
              }
            ],
            'code': '210900',
            'name': '阜新市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '211002',
                'name': '白塔区'
              },
              {
                'code': '211003',
                'name': '文圣区'
              },
              {
                'code': '211004',
                'name': '宏伟区'
              },
              {
                'code': '211005',
                'name': '弓长岭区'
              },
              {
                'code': '211011',
                'name': '太子河区'
              },
              {
                'code': '211021',
                'name': '辽阳县'
              },
              {
                'code': '211081',
                'name': '灯塔市'
              },
              {
                'code': '211082',
                'name': '其它区'
              }
            ],
            'code': '211000',
            'name': '辽阳市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '211202',
                'name': '银州区'
              },
              {
                'code': '211204',
                'name': '清河区'
              },
              {
                'code': '211221',
                'name': '铁岭县'
              },
              {
                'code': '211223',
                'name': '西丰县'
              },
              {
                'code': '211224',
                'name': '昌图县'
              },
              {
                'code': '211281',
                'name': '调兵山市'
              },
              {
                'code': '211282',
                'name': '开原市'
              },
              {
                'code': '211283',
                'name': '其它区'
              }
            ],
            'code': '211200',
            'name': '铁岭市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '211302',
                'name': '双塔区'
              },
              {
                'code': '211303',
                'name': '龙城区'
              },
              {
                'code': '211321',
                'name': '朝阳县'
              },
              {
                'code': '211322',
                'name': '建平县'
              },
              {
                'code': '211324',
                'name': '喀喇沁左翼蒙古族自治县'
              },
              {
                'code': '211381',
                'name': '北票市'
              },
              {
                'code': '211382',
                'name': '凌源市'
              },
              {
                'code': '211383',
                'name': '其它区'
              }
            ],
            'code': '211300',
            'name': '朝阳市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '211102',
                'name': '双台子区'
              },
              {
                'code': '211103',
                'name': '兴隆台区'
              },
              {
                'code': '211121',
                'name': '大洼县'
              },
              {
                'code': '211122',
                'name': '盘山县'
              },
              {
                'code': '211123',
                'name': '其它区'
              }
            ],
            'code': '211100',
            'name': '盘锦市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '211402',
                'name': '连山区'
              },
              {
                'code': '211403',
                'name': '龙港区'
              },
              {
                'code': '211404',
                'name': '南票区'
              },
              {
                'code': '211421',
                'name': '绥中县'
              },
              {
                'code': '211422',
                'name': '建昌县'
              },
              {
                'code': '211481',
                'name': '兴城市'
              },
              {
                'code': '211482',
                'name': '其它区'
              }
            ],
            'code': '211400',
            'name': '葫芦岛市',
            'cityClass': '1'
          }
        ],
        'code': '210000',
        'name': '辽宁省'
      },
      {
        'city': [
          {
            'county': [
              {
                'code': '220102',
                'name': '南关区'
              },
              {
                'code': '220103',
                'name': '宽城区'
              },
              {
                'code': '220104',
                'name': '朝阳区'
              },
              {
                'code': '220104',
                'name': '二道区'
              },
              {
                'code': '220112',
                'name': '双阳区'
              },
              {
                'code': '220122',
                'name': '农安县'
              },
              {
                'code': '220182',
                'name': '榆树市'
              },
              {
                'code': '220183',
                'name': '德惠市'
              },
              {
                'code': '220185',
                'name': '汽车产业开发区'
              },
              {
                'code': '220186',
                'name': '经济技术开发区'
              },
              {
                'code': '220106',
                'name': '绿园区'
              },
              {
                'code': '220181',
                'name': '九台市'
              },
              {
                'code': '220184',
                'name': '高新技术产业开发区'
              },
              {
                'code': '220187',
                'name': '净月旅游开发区'
              },
              {
                'code': '220188',
                'name': '其它区'
              }
            ],
            'code': '220100',
            'name': '长春市',
            'cityClass': '2'
          },
          {
            'code': '220200',
            'name': '长春市',
            'cityClass': '2'
          },
          {
            'code': '220300',
            'name': '吉林市',
            'cityClass': '2'
          },
          {
            'code': '220400',
            'name': '四平市',
            'cityClass': '2'
          },
          {
            'code': '220500',
            'name': '通化市',
            'cityClass': '2'
          },
          {
            'code': '220600',
            'name': '白山市',
            'cityClass': '2'
          },
          {
            'code': '220700',
            'name': '辽源市',
            'cityClass': '2'
          },
          {
            'code': '220800',
            'name': '白城市',
            'cityClass': '2'
          },
          {
            'code': '220900',
            'name': '松原市',
            'cityClass': '2'
          }
        ],
        'code': '220000',
        'name': '吉林省'
      },
      {
        'city': [
          {
            'county': [
              {
                'code': '230102',
                'name': '道里区'
              },
              {
                'code': '230103',
                'name': '南岗区'
              },
              {
                'code': '230104',
                'name': '道外区'
              },
              {
                'code': '230107',
                'name': '动力区'
              },
              {
                'code': '230108',
                'name': '平房区'
              },
              {
                'code': '230109',
                'name': '松北区'
              },
              {
                'code': '230123',
                'name': '依兰县'
              },
              {
                'code': '230124',
                'name': '方正县'
              },
              {
                'code': '230126',
                'name': '巴彦县'
              },
              {
                'code': '230127',
                'name': '木兰县'
              },
              {
                'code': '230129',
                'name': '延寿县'
              },
              {
                'code': '230181',
                'name': '阿城市'
              },
              {
                'code': '230183',
                'name': '尚志市'
              },
              {
                'code': '230184',
                'name': '五常市'
              },
              {
                'code': '230106',
                'name': '香坊区'
              },
              {
                'code': '230111',
                'name': '呼兰区'
              },
              {
                'code': '230125',
                'name': '宾县'
              },
              {
                'code': '230128',
                'name': '通河县'
              },
              {
                'code': '230182',
                'name': '双城市'
              },
              {
                'code': '230185',
                'name': '阿城市'
              },
              {
                'code': '230186',
                'name': '其它区'
              }
            ],
            'code': '230100',
            'name': '哈尔滨市',
            'cityClass': '2'
          },
          {
            'code': '230200',
            'name': '齐齐哈尔市',
            'cityClass': '2'
          },
          {
            'code': '230300',
            'name': '鸡西市',
            'cityClass': '2'
          },
          {
            'code': '230400',
            'name': '鹤岗市',
            'cityClass': '2'
          },
          {
            'code': '230500',
            'name': '双鸭山市',
            'cityClass': '2'
          },
          {
            'code': '230600',
            'name': '大庆市',
            'cityClass': '2'
          },
          {
            'code': '230700',
            'name': '伊春市',
            'cityClass': '2'
          },
          {
            'code': '230800',
            'name': '佳木斯市',
            'cityClass': '2'
          },
          {
            'code': '230900',
            'name': '七台河市',
            'cityClass': '2'
          },
          {
            'code': '231000',
            'name': '牡丹江市',
            'cityClass': '2'
          },
          {
            'code': '231100',
            'name': '黑河市',
            'cityClass': '2'
          },
          {
            'code': '231200',
            'name': '绥化市',
            'cityClass': '2'
          },
          {
            'code': '232700',
            'name': '大兴安岭地区',
            'cityClass': '2'
          }
        ],
        'code': '230000',
        'name': '黑龙江省'
      },
      {
        'city': [
          {
            'county': [
              {
                'code': '310101',
                'name': '黄浦区'
              },
              {
                'code': '310103',
                'name': '卢湾区'
              },
              {
                'code': '310104',
                'name': '徐汇区'
              },
              {
                'code': '310105',
                'name': '长宁区'
              },
              {
                'code': '310106',
                'name': '静安区'
              },
              {
                'code': '310107',
                'name': '普陀区'
              },
              {
                'code': '310108',
                'name': '闸北区'
              },
              {
                'code': '310109',
                'name': '虹口区'
              },
              {
                'code': '310110',
                'name': '杨浦区'
              },
              {
                'code': '310112',
                'name': '闵行区'
              },
              {
                'code': '310113',
                'name': '宝山区'
              },
              {
                'code': '310114',
                'name': '嘉定区'
              },
              {
                'code': '310115',
                'name': '浦东新区'
              },
              {
                'code': '310116',
                'name': '金山区'
              },
              {
                'code': '310117',
                'name': '松江区'
              },
              {
                'code': '310118',
                'name': '青浦区'
              },
              {
                'code': '310119',
                'name': '南汇区'
              },
              {
                'code': '310120',
                'name': '奉贤区'
              },
              {
                'code': '310152',
                'name': '川沙区'
              },
              {
                'code': '310230',
                'name': '崇明县'
              },
              {
                'code': '310231',
                'name': '其它区'
              }
            ],
            'code': '310100',
            'name': '上海市',
            'cityClass': '1'
          }
        ],
        'code': '310000',
        'name': '上海'
      },
      {
        'city': [
          {
            'county': [
              {
                'code': '320102',
                'name': '玄武区'
              },
              {
                'code': '320103',
                'name': '白下区'
              },
              {
                'code': '320104',
                'name': '秦淮区'
              },
              {
                'code': '320105',
                'name': '建邺区'
              },
              {
                'code': '320106',
                'name': '鼓楼区'
              },
              {
                'code': '320107',
                'name': '下关区'
              },
              {
                'code': '320111',
                'name': '浦口区'
              },
              {
                'code': '320113',
                'name': '栖霞区'
              },
              {
                'code': '320114',
                'name': '雨花台区'
              },
              {
                'code': '320115',
                'name': '江宁区'
              },
              {
                'code': '320116',
                'name': '六合区'
              },
              {
                'code': '320124',
                'name': '溧水县'
              },
              {
                'code': '320125',
                'name': '高淳县'
              },
              {
                'code': '320126',
                'name': '其它区'
              }
            ],
            'code': '320100',
            'name': '南京市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '320202',
                'name': '崇安区'
              },
              {
                'code': '320203',
                'name': '南长区'
              },
              {
                'code': '320204',
                'name': '北塘区'
              },
              {
                'code': '320205',
                'name': '锡山区'
              },
              {
                'code': '320206',
                'name': '惠山区'
              },
              {
                'code': '320211',
                'name': '滨湖区'
              },
              {
                'code': '321881',
                'name': '江阴市'
              },
              {
                'code': '320282',
                'name': '宜兴市'
              },
              {
                'code': '320296',
                'name': '新区'
              },
              {
                'code': '320297',
                'name': '其它区'
              }
            ],
            'code': '320200',
            'name': '无锡市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '320302',
                'name': '鼓楼区'
              },
              {
                'code': '320303',
                'name': '云龙区'
              },
              {
                'code': '320304',
                'name': '九里区'
              },
              {
                'code': '320305',
                'name': '贾汪区'
              },
              {
                'code': '320311',
                'name': '泉山区'
              },
              {
                'code': '320321',
                'name': '丰县'
              },
              {
                'code': '320322',
                'name': '沛县'
              },
              {
                'code': '320323',
                'name': '铜山县'
              },
              {
                'code': '320324',
                'name': '睢宁县'
              },
              {
                'code': '320381',
                'name': '新沂市'
              },
              {
                'code': '320382',
                'name': '邳州市'
              },
              {
                'code': '320383',
                'name': '其它区'
              }
            ],
            'code': '320300',
            'name': '徐州市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '320402',
                'name': '天宁区'
              },
              {
                'code': '320405',
                'name': '戚墅堰区'
              },
              {
                'code': '320411',
                'name': '新北区'
              },
              {
                'code': '320412',
                'name': '武进区'
              },
              {
                'code': '320482',
                'name': '金坛市'
              },
              {
                'code': '320404',
                'name': '钟楼区'
              },
              {
                'code': '320481',
                'name': '溧阳市'
              },
              {
                'code': '320483',
                'name': '其它区'
              }
            ],
            'code': '320400',
            'name': '常州市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '320502',
                'name': '沧浪区'
              },
              {
                'code': '320503',
                'name': '平江区'
              },
              {
                'code': '320504',
                'name': '金阊区'
              },
              {
                'code': '320505',
                'name': '虎丘区'
              },
              {
                'code': '320506',
                'name': '吴中区'
              },
              {
                'code': '320507',
                'name': '相城区'
              },
              {
                'code': '320581',
                'name': '常熟市'
              },
              {
                'code': '320582',
                'name': '张家港市'
              },
              {
                'code': '320583',
                'name': '昆山市'
              },
              {
                'code': '320584',
                'name': '吴江市'
              },
              {
                'code': '320585',
                'name': '太仓市'
              },
              {
                'code': '320594',
                'name': '新区'
              },
              {
                'code': '320595',
                'name': '园区'
              },
              {
                'code': '320596',
                'name': '其它区'
              }
            ],
            'code': '320500',
            'name': '苏州市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '320602',
                'name': '崇川区'
              },
              {
                'code': '320611',
                'name': '港闸区'
              },
              {
                'code': '320621',
                'name': '海安县'
              },
              {
                'code': '320623',
                'name': '如东县'
              },
              {
                'code': '320681',
                'name': '启东市'
              },
              {
                'code': '320682',
                'name': '如皋市'
              },
              {
                'code': '320683',
                'name': '通州市'
              },
              {
                'code': '320693',
                'name': '开发区'
              },
              {
                'code': '321984',
                'name': '海门市'
              },
              {
                'code': '320694',
                'name': '其它区'
              }
            ],
            'code': '320600',
            'name': '南通市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '320703',
                'name': '连云区'
              },
              {
                'code': '320705',
                'name': '新浦区'
              },
              {
                'code': '320706',
                'name': '海州区'
              },
              {
                'code': '320721',
                'name': '赣榆县'
              },
              {
                'code': '320722',
                'name': '东海县'
              },
              {
                'code': '320723',
                'name': '灌云县'
              },
              {
                'code': '320724',
                'name': '灌南县'
              },
              {
                'code': '320725',
                'name': '其它区'
              }
            ],
            'code': '320700',
            'name': '连云港市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '320802',
                'name': '清河区'
              },
              {
                'code': '320803',
                'name': '楚州区'
              },
              {
                'code': '320804',
                'name': '淮阴区'
              },
              {
                'code': '320811',
                'name': '清浦区'
              },
              {
                'code': '320826',
                'name': '涟水县'
              },
              {
                'code': '320829',
                'name': '洪泽县'
              },
              {
                'code': '320830',
                'name': '盱眙县'
              },
              {
                'code': '320831',
                'name': '金湖县'
              },
              {
                'code': '320832',
                'name': '其它区'
              }
            ],
            'code': '320800',
            'name': '淮安市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '320902',
                'name': '亭湖区'
              },
              {
                'code': '320903',
                'name': '盐都区'
              },
              {
                'code': '320921',
                'name': '响水县'
              },
              {
                'code': '320922',
                'name': '滨海县'
              },
              {
                'code': '320923',
                'name': '阜宁县'
              },
              {
                'code': '320924',
                'name': '射阳县'
              },
              {
                'code': '320925',
                'name': '建湖县'
              },
              {
                'code': '320981',
                'name': '东台市'
              },
              {
                'code': '320982',
                'name': '大丰市'
              },
              {
                'code': '320983',
                'name': '其它区'
              }
            ],
            'code': '320900',
            'name': '盐城市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '321002',
                'name': '广陵区'
              },
              {
                'code': '321003',
                'name': '邗江区'
              },
              {
                'code': '321011',
                'name': '维扬区'
              },
              {
                'code': '321023',
                'name': '宝应县'
              },
              {
                'code': '321081',
                'name': '仪征市'
              },
              {
                'code': '321084',
                'name': '高邮市'
              },
              {
                'code': '321088',
                'name': '江都市'
              },
              {
                'code': '321092',
                'name': '经济开发区'
              },
              {
                'code': '321093',
                'name': '其它区'
              }
            ],
            'code': '321000',
            'name': '扬州市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '321102',
                'name': '京口区'
              },
              {
                'code': '321111',
                'name': '润州区'
              },
              {
                'code': '321112',
                'name': '丹徒区'
              },
              {
                'code': '321181',
                'name': '丹阳市'
              },
              {
                'code': '321182',
                'name': '扬中市'
              },
              {
                'code': '321183',
                'name': '句容市'
              },
              {
                'code': '321184',
                'name': '其它区'
              }
            ],
            'code': '321100',
            'name': '镇江市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '321201',
                'name': '市辖区'
              },
              {
                'code': '321202',
                'name': '海陵区'
              },
              {
                'code': '321203',
                'name': '高港区'
              },
              {
                'code': '321281',
                'name': '兴化市'
              },
              {
                'code': '321282',
                'name': '靖江市'
              },
              {
                'code': '321283',
                'name': '泰兴市'
              },
              {
                'code': '321284',
                'name': '姜堰市'
              },
              {
                'code': '321285',
                'name': '其它区'
              }
            ],
            'code': '321200',
            'name': '泰州市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '321302',
                'name': '宿城区'
              },
              {
                'code': '321311',
                'name': '宿豫区'
              },
              {
                'code': '321322',
                'name': '沭阳县'
              },
              {
                'code': '321323',
                'name': '泗阳县'
              },
              {
                'code': '321324',
                'name': '泗洪县'
              },
              {
                'code': '321325',
                'name': '其它区'
              }
            ],
            'code': '321300',
            'name': '宿迁市',
            'cityClass': '1'
          }
        ],
        'code': '320000',
        'name': '江苏省'
      },
      {
        'city': [
          {
            'county': [
              {
                'code': '330102',
                'name': '上城区'
              },
              {
                'code': '330103',
                'name': '下城区'
              },
              {
                'code': '330104',
                'name': '江干区'
              },
              {
                'code': '330105',
                'name': '拱墅区'
              },
              {
                'code': '330106',
                'name': '西湖区'
              },
              {
                'code': '330108',
                'name': '滨江区'
              },
              {
                'code': '330109',
                'name': '萧山区'
              },
              {
                'code': '330110',
                'name': '余杭区'
              },
              {
                'code': '330122',
                'name': '桐庐县'
              },
              {
                'code': '330127',
                'name': '淳安县'
              },
              {
                'code': '330182',
                'name': '建德市'
              },
              {
                'code': '330183',
                'name': '富阳市'
              },
              {
                'code': '330185',
                'name': '临安市'
              },
              {
                'code': '330186',
                'name': '其它区'
              }
            ],
            'code': '330100',
            'name': '杭州市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '330203',
                'name': '海曙区'
              },
              {
                'code': '330204',
                'name': '江东区'
              },
              {
                'code': '330205',
                'name': '江北区'
              },
              {
                'code': '330206',
                'name': '北仑区'
              },
              {
                'code': '330211',
                'name': '镇海区'
              },
              {
                'code': '330212',
                'name': '鄞州区'
              },
              {
                'code': '330225',
                'name': '象山县'
              },
              {
                'code': '330226',
                'name': '宁海县'
              },
              {
                'code': '330281',
                'name': '余姚市'
              },
              {
                'code': '330282',
                'name': '慈溪市'
              },
              {
                'code': '330283',
                'name': '奉化市'
              },
              {
                'code': '330284',
                'name': '其它区'
              }
            ],
            'code': '330200',
            'name': '宁波市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '330302',
                'name': '鹿城区'
              },
              {
                'code': '330303',
                'name': '龙湾区'
              },
              {
                'code': '330304',
                'name': '瓯海区'
              },
              {
                'code': '330322',
                'name': '洞头县'
              },
              {
                'code': '330324',
                'name': '永嘉县'
              },
              {
                'code': '330326',
                'name': '平阳县'
              },
              {
                'code': '330327',
                'name': '苍南县'
              },
              {
                'code': '330328',
                'name': '文成县'
              },
              {
                'code': '330329',
                'name': '泰顺县'
              },
              {
                'code': '330381',
                'name': '瑞安市'
              },
              {
                'code': '330382',
                'name': '乐清市'
              },
              {
                'code': '330383',
                'name': '其它区'
              }
            ],
            'code': '330300',
            'name': '温州市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '330402',
                'name': '南湖区'
              },
              {
                'code': '330411',
                'name': '秀洲区'
              },
              {
                'code': '330421',
                'name': '嘉善县'
              },
              {
                'code': '330424',
                'name': '海盐县'
              },
              {
                'code': '330481',
                'name': '海宁市'
              },
              {
                'code': '330482',
                'name': '平湖市'
              },
              {
                'code': '330483',
                'name': '桐乡市'
              },
              {
                'code': '330484',
                'name': '其它区'
              }
            ],
            'code': '330400',
            'name': '嘉兴市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '330502',
                'name': '吴兴区'
              },
              {
                'code': '330503',
                'name': '南浔区'
              },
              {
                'code': '330521',
                'name': '德清县'
              },
              {
                'code': '330523',
                'name': '安吉县'
              },
              {
                'code': '330522',
                'name': '长兴县'
              },
              {
                'code': '330524',
                'name': '其它区'
              }
            ],
            'code': '330500',
            'name': '湖州市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '330602',
                'name': '越城区'
              },
              {
                'code': '330621',
                'name': '绍兴县'
              },
              {
                'code': '330624',
                'name': '新昌县'
              },
              {
                'code': '330681',
                'name': '诸暨市'
              },
              {
                'code': '330682',
                'name': '上虞市'
              },
              {
                'code': '330683',
                'name': '嵊州市'
              },
              {
                'code': '330684',
                'name': '其它区'
              }
            ],
            'code': '330600',
            'name': '绍兴市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '330701',
                'name': '市辖区'
              },
              {
                'code': '330702',
                'name': '婺城区'
              },
              {
                'code': '330703',
                'name': '金东区'
              },
              {
                'code': '330723',
                'name': '武义县'
              },
              {
                'code': '330726',
                'name': '浦江县'
              },
              {
                'code': '330727',
                'name': '磐安县'
              },
              {
                'code': '330781',
                'name': '兰溪市'
              }
            ],
            'code': '330700',
            'name': '金华市',
            'cityClass': '1'
          },
          {
            'code': '330782',
            'name': '义乌市',
            'cityClass': '1'
          },
          {
            'code': '330783',
            'name': '东阳市',
            'cityClass': '1'
          },
          {
            'code': '330784',
            'name': '永康市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '330802',
                'name': '柯城区'
              },
              {
                'code': '330803',
                'name': '衢江区'
              },
              {
                'code': '331422',
                'name': '常山县'
              },
              {
                'code': '330824',
                'name': '开化县'
              },
              {
                'code': '330825',
                'name': '龙游县'
              },
              {
                'code': '330881',
                'name': '江山市'
              },
              {
                'code': '330882',
                'name': '其它区'
              }
            ],
            'code': '330800',
            'name': '衢州市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '330902',
                'name': '定海区'
              },
              {
                'code': '330903',
                'name': '普陀区'
              },
              {
                'code': '330921',
                'name': '岱山县'
              },
              {
                'code': '330922',
                'name': '嵊泗县'
              },
              {
                'code': '330922',
                'name': '其它区'
              }
            ],
            'code': '330900',
            'name': '舟山市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '331002',
                'name': '椒江区'
              },
              {
                'code': '331003',
                'name': '黄岩区'
              },
              {
                'code': '331004',
                'name': '路桥区'
              },
              {
                'code': '331021',
                'name': '玉环县'
              },
              {
                'code': '331022',
                'name': '三门县'
              },
              {
                'code': '331023',
                'name': '天台县'
              },
              {
                'code': '331024',
                'name': '仙居县'
              },
              {
                'code': '331081',
                'name': '温岭市'
              },
              {
                'code': '331082',
                'name': '临海市'
              },
              {
                'code': '331083',
                'name': '其它区'
              }
            ],
            'code': '331000',
            'name': '台州市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '331102',
                'name': '莲都区'
              },
              {
                'code': '331121',
                'name': '青田县'
              },
              {
                'code': '331122',
                'name': '缙云县'
              },
              {
                'code': '331123',
                'name': '遂昌县'
              },
              {
                'code': '331124',
                'name': '松阳县'
              },
              {
                'code': '331125',
                'name': '云和县'
              },
              {
                'code': '331126',
                'name': '庆元县'
              },
              {
                'code': '331127',
                'name': '景宁畲族自治县'
              },
              {
                'code': '331181',
                'name': '龙泉市'
              },
              {
                'code': '331182',
                'name': '其它区'
              }
            ],
            'code': '331100',
            'name': '丽水市',
            'cityClass': '1'
          }
        ],
        'code': '330000',
        'name': '浙江省'
      },
      {
        'city': [
          {
            'county': [
              {
                'code': '340102',
                'name': '瑶海区'
              },
              {
                'code': '340103',
                'name': '庐阳区'
              },
              {
                'code': '340104',
                'name': '蜀山区'
              },
              {
                'code': '340111',
                'name': '包河区'
              },
              {
                'code': '340121',
                'name': '长丰县'
              },
              {
                'code': '340122',
                'name': '肥东县'
              },
              {
                'code': '340123',
                'name': '肥西县'
              },
              {
                'code': '340151',
                'name': '高新区'
              },
              {
                'code': '340191',
                'name': '中区'
              },
              {
                'code': '340192',
                'name': '其它区'
              }
            ],
            'code': '340100',
            'name': '合肥市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '340202',
                'name': '镜湖区'
              },
              {
                'code': '340203',
                'name': '弋江区'
              },
              {
                'code': '340207',
                'name': '鸠江区'
              },
              {
                'code': '340221',
                'name': '芜湖县'
              },
              {
                'code': '340223',
                'name': '繁昌县'
              },
              {
                'code': '340208',
                'name': '三山区'
              },
              {
                'code': '340223',
                'name': '南陵县'
              },
              {
                'code': '340224',
                'name': '其它区'
              }
            ],
            'code': '340200',
            'name': '芜湖市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '340302',
                'name': '龙子湖区'
              },
              {
                'code': '340304',
                'name': '禹会区'
              },
              {
                'code': '340311',
                'name': '淮上区'
              },
              {
                'code': '340322',
                'name': '五河县'
              },
              {
                'code': '340323',
                'name': '固镇县'
              },
              {
                'code': '340303',
                'name': '蚌山区'
              },
              {
                'code': '340321',
                'name': '怀远县'
              },
              {
                'code': '340324',
                'name': '其它区'
              }
            ],
            'code': '340300',
            'name': '蚌埠市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '340802',
                'name': '迎江区'
              },
              {
                'code': '340803',
                'name': '大观区'
              },
              {
                'code': '340811',
                'name': '宜秀区'
              },
              {
                'code': '340823',
                'name': '枞阳县'
              },
              {
                'code': '340824',
                'name': '潜山县'
              },
              {
                'code': '340826',
                'name': '宿松县'
              },
              {
                'code': '340827',
                'name': '望江县'
              },
              {
                'code': '340881',
                'name': '桐城市'
              },
              {
                'code': '340825',
                'name': '怀宁县'
              },
              {
                'code': '340825',
                'name': '太湖县'
              },
              {
                'code': '340828',
                'name': '岳西县'
              },
              {
                'code': '340882',
                'name': '其它区'
              }
            ],
            'code': '340800',
            'name': '安庆市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '341002',
                'name': '屯溪区'
              },
              {
                'code': '341003',
                'name': '黄山区'
              },
              {
                'code': '341004',
                'name': '徽州区'
              },
              {
                'code': '341022',
                'name': '休宁县'
              },
              {
                'code': '341023',
                'name': '黟县'
              },
              {
                'code': '341021',
                'name': '歙县'
              },
              {
                'code': '341024',
                'name': '祁门县'
              },
              {
                'code': '341025',
                'name': '其它区'
              }
            ],
            'code': '341000',
            'name': '黄山市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '341102',
                'name': '琅琊区'
              },
              {
                'code': '341122',
                'name': '来安县'
              },
              {
                'code': '341124',
                'name': '全椒县'
              },
              {
                'code': '341126',
                'name': '凤阳县'
              },
              {
                'code': '341181',
                'name': '天长市'
              },
              {
                'code': '341103',
                'name': '南谯区'
              },
              {
                'code': '341125',
                'name': '定远县'
              },
              {
                'code': '341182',
                'name': '明光市'
              },
              {
                'code': '341183',
                'name': '其它区'
              }
            ],
            'code': '341100',
            'name': '滁州市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '341202',
                'name': '颍州区'
              },
              {
                'code': '341204',
                'name': '颍泉区'
              },
              {
                'code': '341221',
                'name': '临泉县'
              },
              {
                'code': '341225',
                'name': '阜南县'
              },
              {
                'code': '341283',
                'name': '颍上县'
              },
              {
                'code': '341203',
                'name': '颍东区'
              },
              {
                'code': '341222',
                'name': '太和县'
              },
              {
                'code': '341282',
                'name': '界首市'
              },
              {
                'code': '341283',
                'name': '其它区'
              }
            ],
            'code': '341200',
            'name': '阜阳市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '341302',
                'name': '埇桥区'
              },
              {
                'code': '341322',
                'name': '萧县'
              },
              {
                'code': '341323',
                'name': '灵璧县'
              },
              {
                'code': '341324',
                'name': '泗县'
              },
              {
                'code': '341321',
                'name': '砀山县'
              },
              {
                'code': '341325',
                'name': '其它区'
              }
            ],
            'code': '341300',
            'name': '宿州市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '341502',
                'name': '金安区'
              },
              {
                'code': '341503',
                'name': '裕安区'
              },
              {
                'code': '341522',
                'name': '霍邱县'
              },
              {
                'code': '341523',
                'name': '舒城县'
              },
              {
                'code': '341525',
                'name': '霍山县'
              },
              {
                'code': '341521',
                'name': '寿县'
              },
              {
                'code': '341524',
                'name': '金寨县'
              },
              {
                'code': '341526',
                'name': '其它区'
              }
            ],
            'code': '341500',
            'name': '六安市',
            'cityClass': '1'
          },
          {
            'code': '341600',
            'name': '淮南市',
            'cityClass': '1'
          },
          {
            'code': '341700',
            'name': '池州市',
            'cityClass': '1'
          }
        ],
        'code': '340000',
        'name': '安徽省'
      },
      {
        'city': [
          {
            'county': [
              {
                'code': '350102',
                'name': '鼓楼区'
              },
              {
                'code': '350103',
                'name': '台江区'
              },
              {
                'code': '350104',
                'name': '仓山区'
              },
              {
                'code': '350105',
                'name': '马尾区'
              },
              {
                'code': '350111',
                'name': '晋安区'
              },
              {
                'code': '350121',
                'name': '闽侯县'
              },
              {
                'code': '350122',
                'name': '连江县'
              },
              {
                'code': '350123',
                'name': '罗源县'
              },
              {
                'code': '350124',
                'name': '闽清县'
              },
              {
                'code': '350125',
                'name': '永泰县'
              },
              {
                'code': '350128',
                'name': '平潭县'
              },
              {
                'code': '350181',
                'name': '福清市'
              },
              {
                'code': '350182',
                'name': '长乐市'
              },
              {
                'code': '350183',
                'name': '其它区'
              }
            ],
            'code': '350100',
            'name': '福州市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '350203',
                'name': '思明区'
              },
              {
                'code': '350205',
                'name': '海沧区'
              },
              {
                'code': '350206',
                'name': '湖里区'
              },
              {
                'code': '350211',
                'name': '集美区'
              },
              {
                'code': '350212',
                'name': '同安区'
              },
              {
                'code': '350213',
                'name': '翔安区'
              },
              {
                'code': '350214',
                'name': '其它区'
              }
            ],
            'code': '350200',
            'name': '厦门市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '350301',
                'name': '市辖区'
              },
              {
                'code': '350302',
                'name': '城厢区'
              },
              {
                'code': '350303',
                'name': '涵江区'
              },
              {
                'code': '350304',
                'name': '荔城区'
              },
              {
                'code': '350305',
                'name': '秀屿区'
              },
              {
                'code': '350322',
                'name': '仙游县'
              },
              {
                'code': '350323',
                'name': '其它区'
              }
            ],
            'code': '350300',
            'name': '莆田市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '350402',
                'name': '梅列区'
              },
              {
                'code': '350403',
                'name': '三元区'
              },
              {
                'code': '350421',
                'name': '明溪县'
              },
              {
                'code': '350423',
                'name': '清流县'
              },
              {
                'code': '350424',
                'name': '宁化县'
              },
              {
                'code': '350425',
                'name': '大田县'
              },
              {
                'code': '350426',
                'name': '尤溪县'
              },
              {
                'code': '350427',
                'name': '沙县'
              },
              {
                'code': '350428',
                'name': '将乐县'
              },
              {
                'code': '350429',
                'name': '泰宁县'
              },
              {
                'code': '350430',
                'name': '建宁县'
              },
              {
                'code': '350481',
                'name': '永安市'
              },
              {
                'code': '350482',
                'name': '其它区'
              }
            ],
            'code': '350400',
            'name': '三明市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '350502',
                'name': '鲤城区'
              },
              {
                'code': '350503',
                'name': '丰泽区'
              },
              {
                'code': '350504',
                'name': '洛江区'
              },
              {
                'code': '350505',
                'name': '泉港区'
              },
              {
                'code': '350521',
                'name': '惠安县'
              },
              {
                'code': '350524',
                'name': '安溪县'
              },
              {
                'code': '350525',
                'name': '永春县'
              },
              {
                'code': '350526',
                'name': '德化县'
              },
              {
                'code': '350527',
                'name': '金门县'
              },
              {
                'code': '350581',
                'name': '石狮市'
              },
              {
                'code': '350582',
                'name': '晋江市'
              },
              {
                'code': '350583',
                'name': '南安市'
              },
              {
                'code': '350584',
                'name': '其它区'
              }
            ],
            'code': '350500',
            'name': '泉州市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '350602',
                'name': '芗城区'
              },
              {
                'code': '350603',
                'name': '龙文区'
              },
              {
                'code': '350622',
                'name': '云霄县'
              },
              {
                'code': '350623',
                'name': '漳浦县'
              },
              {
                'code': '350624',
                'name': '诏安县'
              },
              {
                'code': '350625',
                'name': '长泰县'
              },
              {
                'code': '350626',
                'name': '东山县'
              },
              {
                'code': '350627',
                'name': '南靖县'
              },
              {
                'code': '350628',
                'name': '平和县'
              },
              {
                'code': '350629',
                'name': '华安县'
              },
              {
                'code': '350681',
                'name': '龙海市'
              },
              {
                'code': '350682',
                'name': '其它区'
              }
            ],
            'code': '350600',
            'name': '漳州市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '350802',
                'name': '新罗区'
              },
              {
                'code': '350823',
                'name': '上杭县'
              },
              {
                'code': '350881',
                'name': '漳平市'
              },
              {
                'code': '350821',
                'name': '长汀县'
              },
              {
                'code': '350822',
                'name': '永定县'
              },
              {
                'code': '350824',
                'name': '武平县'
              },
              {
                'code': '350825',
                'name': '连城县'
              },
              {
                'code': '350882',
                'name': '其它区'
              }
            ],
            'code': '350800',
            'name': '龙岩市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '350902',
                'name': '蕉城区'
              },
              {
                'code': '350921',
                'name': '霞浦县'
              },
              {
                'code': '350922',
                'name': '古田县'
              },
              {
                'code': '350923',
                'name': '屏南县'
              },
              {
                'code': '350924',
                'name': '寿宁县'
              },
              {
                'code': '350925',
                'name': '周宁县'
              },
              {
                'code': '350926',
                'name': '柘荣县'
              },
              {
                'code': '350981',
                'name': '福安市'
              },
              {
                'code': '350982',
                'name': '福鼎市'
              },
              {
                'code': '350983',
                'name': '其它区'
              }
            ],
            'code': '350900',
            'name': '宁德市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '350702',
                'name': '延平区'
              },
              {
                'code': '350721',
                'name': '顺昌县'
              },
              {
                'code': '350722',
                'name': '浦城县'
              },
              {
                'code': '350723',
                'name': '光泽县'
              },
              {
                'code': '350724',
                'name': '松溪县'
              },
              {
                'code': '350725',
                'name': '政和县'
              },
              {
                'code': '350781',
                'name': '邵武市'
              },
              {
                'code': '350782',
                'name': '武夷山市'
              },
              {
                'code': '350783',
                'name': '建瓯市'
              },
              {
                'code': '350784',
                'name': '建阳市'
              },
              {
                'code': '350785',
                'name': '其它区'
              }
            ],
            'code': '350700',
            'name': '南平市',
            'cityClass': '1'
          }
        ],
        'code': '350000',
        'name': '福建省'
      },
      {
        'city': [
          {
            'county': [
              {
                'code': '360103',
                'name': '西湖区'
              },
              {
                'code': '360104',
                'name': '青云谱区'
              },
              {
                'code': '360111',
                'name': '青山湖区'
              },
              {
                'code': '360121',
                'name': '南昌县'
              },
              {
                'code': '360123',
                'name': '安义县'
              },
              {
                'code': '360124',
                'name': '进贤县'
              },
              {
                'code': '360126',
                'name': '经济技术开发区'
              },
              {
                'code': '360127',
                'name': '昌北区'
              },
              {
                'code': '360102',
                'name': '东湖区'
              },
              {
                'code': '360105',
                'name': '湾里区'
              },
              {
                'code': '360122',
                'name': '新建县'
              },
              {
                'code': '360125',
                'name': '红谷滩新区'
              },
              {
                'code': '360128',
                'name': '其它区'
              }
            ],
            'code': '360100',
            'name': '南昌市',
            'cityClass': '1'
          },
          {
            'code': '360700',
            'name': '赣州市',
            'cityClass': '1'
          },
          {
            'code': '360800',
            'name': '吉安市',
            'cityClass': '1'
          },
          {
            'code': '360300',
            'name': '萍乡市',
            'cityClass': '1'
          },
          {
            'code': '360900',
            'name': '宜春市',
            'cityClass': '1'
          },
          {
            'code': '360500',
            'name': '新余市',
            'cityClass': '1'
          },
          {
            'code': '360200',
            'name': '景德镇市',
            'cityClass': '1'
          },
          {
            'code': '361000',
            'name': '抚州市',
            'cityClass': '1'
          },
          {
            'code': '360400',
            'name': '九江市',
            'cityClass': '1'
          },
          {
            'code': '361100',
            'name': '上饶市',
            'cityClass': '1'
          },
          {
            'code': '360600',
            'name': '鹰潭市',
            'cityClass': '1'
          }
        ],
        'code': '360000',
        'name': '江西省'
      },
      {
        'city': [
          {
            'county': [
              {
                'code': '370104',
                'name': '槐荫区'
              },
              {
                'code': '370125',
                'name': '济阳县'
              },
              {
                'code': '370124',
                'name': '平阴县'
              },
              {
                'code': '370181',
                'name': '章丘市'
              },
              {
                'code': '370102',
                'name': '历下区'
              },
              {
                'code': '370103',
                'name': '市中区'
              },
              {
                'code': '370113',
                'name': '长清区'
              },
              {
                'code': '370126',
                'name': '商河县'
              },
              {
                'code': '370105',
                'name': '天桥区'
              },
              {
                'code': '370112',
                'name': '历城区'
              },
              {
                'code': '370182',
                'name': '其它区'
              }
            ],
            'code': '370100',
            'name': '济南市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '370202',
                'name': '市南区'
              },
              {
                'code': '370203',
                'name': '市北区'
              },
              {
                'code': '370205',
                'name': '四方区'
              },
              {
                'code': '370211',
                'name': '黄岛区'
              },
              {
                'code': '370212',
                'name': '崂山区'
              },
              {
                'code': '370213',
                'name': '李沧区'
              },
              {
                'code': '370214',
                'name': '城阳区'
              },
              {
                'code': '370251',
                'name': '开发区'
              },
              {
                'code': '370281',
                'name': '胶州市'
              },
              {
                'code': '370282',
                'name': '即墨市'
              },
              {
                'code': '370283',
                'name': '平度市'
              },
              {
                'code': '370284',
                'name': '胶南市'
              },
              {
                'code': '370285',
                'name': '莱西市'
              },
              {
                'code': '370286',
                'name': '其它区'
              }
            ],
            'code': '370200',
            'name': '青岛市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '370303',
                'name': '张店区'
              },
              {
                'code': '370322',
                'name': '高青县'
              },
              {
                'code': '370305',
                'name': '临淄区'
              },
              {
                'code': '370321',
                'name': '桓台县'
              },
              {
                'code': '370323',
                'name': '沂源县'
              },
              {
                'code': '370302',
                'name': '淄川区'
              },
              {
                'code': '370304',
                'name': '博山区'
              },
              {
                'code': '370306',
                'name': '周村区'
              },
              {
                'code': '370324',
                'name': '其它区'
              }
            ],
            'code': '370300',
            'name': '淄博市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '370403',
                'name': '薛城区'
              },
              {
                'code': '370404',
                'name': '峄城区'
              },
              {
                'code': '370406',
                'name': '山亭区'
              },
              {
                'code': '370481',
                'name': '滕州市'
              },
              {
                'code': '370402',
                'name': '市中区'
              },
              {
                'code': '370405',
                'name': '台儿庄区'
              },
              {
                'code': '370482',
                'name': '其它区'
              }
            ],
            'code': '370400',
            'name': '枣庄市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '371083',
                'name': '乳山市'
              },
              {
                'code': '371082',
                'name': '荣成市'
              },
              {
                'code': '371002',
                'name': '环翠区'
              },
              {
                'code': '371081',
                'name': '文登市'
              },
              {
                'code': '371084',
                'name': '其它区'
              }
            ],
            'code': '371000',
            'name': '威海市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '370685',
                'name': '招远市'
              },
              {
                'code': '370681',
                'name': '龙口市'
              },
              {
                'code': '370613',
                'name': '莱山区'
              },
              {
                'code': '370686',
                'name': '栖霞市'
              },
              {
                'code': '370684',
                'name': '蓬莱市'
              },
              {
                'code': '370611',
                'name': '福山区'
              },
              {
                'code': '370612',
                'name': '牟平区'
              },
              {
                'code': '370634',
                'name': '长岛县'
              },
              {
                'code': '370602',
                'name': '芝罘区'
              },
              {
                'code': '370687',
                'name': '海阳市'
              },
              {
                'code': '370683',
                'name': '莱州市'
              },
              {
                'code': '370682',
                'name': '莱阳市'
              },
              {
                'code': '370688',
                'name': '其它区'
              }
            ],
            'code': '370600',
            'name': '烟台市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '370785',
                'name': '高密市'
              },
              {
                'code': '370783',
                'name': '寿光市'
              },
              {
                'code': '370724',
                'name': '临朐县'
              },
              {
                'code': '370725',
                'name': '昌乐县'
              },
              {
                'code': '370751',
                'name': '开发区'
              },
              {
                'code': '370784',
                'name': '安丘市'
              },
              {
                'code': '370705',
                'name': '奎文区'
              },
              {
                'code': '370703',
                'name': '寒亭区'
              },
              {
                'code': '370786',
                'name': '昌邑市'
              },
              {
                'code': '370702',
                'name': '潍城区'
              },
              {
                'code': '370781',
                'name': '青州市'
              },
              {
                'code': '370704',
                'name': '坊子区'
              },
              {
                'code': '370782',
                'name': '诸城市'
              },
              {
                'code': '370787',
                'name': '其它区'
              }
            ],
            'code': '370700',
            'name': '潍坊市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '371426',
                'name': '平原县'
              },
              {
                'code': '371428',
                'name': '武城县'
              },
              {
                'code': '371482',
                'name': '禹城市'
              },
              {
                'code': '371427',
                'name': '夏津县'
              },
              {
                'code': '371481',
                'name': '乐陵市'
              },
              {
                'code': '371425',
                'name': '齐河县'
              },
              {
                'code': '371422',
                'name': '宁津县'
              },
              {
                'code': '371451',
                'name': '开发区'
              },
              {
                'code': '371402',
                'name': '德城区'
              },
              {
                'code': '371421',
                'name': '陵县'
              },
              {
                'code': '371423',
                'name': '庆云县'
              },
              {
                'code': '371424',
                'name': '临邑县'
              },
              {
                'code': '371483',
                'name': '其它区'
              }
            ],
            'code': '371400',
            'name': '德州市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '371621',
                'name': '惠民县'
              },
              {
                'code': '371626',
                'name': '邹平县'
              },
              {
                'code': '371622',
                'name': '阳信县'
              },
              {
                'code': '371624',
                'name': '沾化县'
              },
              {
                'code': '371602',
                'name': '滨城区'
              },
              {
                'code': '371625',
                'name': '博兴县'
              },
              {
                'code': '371623',
                'name': '无棣县'
              },
              {
                'code': '371627',
                'name': '其它区'
              }
            ],
            'code': '371600',
            'name': '滨州市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '370522',
                'name': '利津县'
              },
              {
                'code': '370503',
                'name': '河口区'
              },
              {
                'code': '370590',
                'name': '东城区'
              },
              {
                'code': '370589',
                'name': '西城区'
              },
              {
                'code': '370523',
                'name': '广饶县'
              },
              {
                'code': '370521',
                'name': '垦利县'
              },
              {
                'code': '370502',
                'name': '东营区'
              },
              {
                'code': '370591',
                'name': '其它区'
              }
            ],
            'code': '370500',
            'name': '东营市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '371121',
                'name': '五莲县'
              },
              {
                'code': '371122',
                'name': '莒县'
              },
              {
                'code': '371102',
                'name': '东港区'
              },
              {
                'code': '371103',
                'name': '岚山区'
              },
              {
                'code': '371123',
                'name': '其它区'
              }
            ],
            'code': '371100',
            'name': '日照市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '371502',
                'name': '东昌府区'
              },
              {
                'code': '371521',
                'name': '阳谷县'
              },
              {
                'code': '371522',
                'name': '莘县'
              },
              {
                'code': '371523',
                'name': '茌平县'
              },
              {
                'code': '371524',
                'name': '东阿县'
              },
              {
                'code': '371525',
                'name': '冠县'
              },
              {
                'code': '371526',
                'name': '高唐县'
              },
              {
                'code': '371581',
                'name': '临清市'
              },
              {
                'code': '371582',
                'name': '其它区'
              }
            ],
            'code': '371500',
            'name': '聊城市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '370902',
                'name': '泰山区'
              },
              {
                'code': '370903',
                'name': '岱岳区'
              },
              {
                'code': '370921',
                'name': '宁阳县'
              },
              {
                'code': '370923',
                'name': '东平县'
              },
              {
                'code': '370982',
                'name': '新泰市'
              },
              {
                'code': '370983',
                'name': '肥城市'
              },
              {
                'code': '370984',
                'name': '其它区'
              }
            ],
            'code': '370900',
            'name': '泰安市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '371702',
                'name': '牡丹区'
              },
              {
                'code': '371721',
                'name': '曹县'
              },
              {
                'code': '371722',
                'name': '单县'
              },
              {
                'code': '371723',
                'name': '成武县'
              },
              {
                'code': '371724',
                'name': '巨野县'
              },
              {
                'code': '371725',
                'name': '郓城县'
              },
              {
                'code': '371726',
                'name': '鄄城县'
              },
              {
                'code': '371727',
                'name': '定陶县'
              },
              {
                'code': '371728',
                'name': '东明县'
              },
              {
                'code': '371729',
                'name': '其它区'
              }
            ],
            'code': '371700',
            'name': '菏泽市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '370802',
                'name': '市中区'
              },
              {
                'code': '370811',
                'name': '任城区'
              },
              {
                'code': '370826',
                'name': '微山县'
              },
              {
                'code': '370827',
                'name': '鱼台县'
              },
              {
                'code': '370828',
                'name': '金乡县'
              },
              {
                'code': '370829',
                'name': '嘉祥县'
              },
              {
                'code': '370830',
                'name': '汶上县'
              },
              {
                'code': '370831',
                'name': '泗水县'
              },
              {
                'code': '370832',
                'name': '梁山县'
              },
              {
                'code': '370881',
                'name': '曲阜市'
              },
              {
                'code': '370882',
                'name': '兖州市'
              },
              {
                'code': '370883',
                'name': '邹城市'
              },
              {
                'code': '370884',
                'name': '其它区'
              }
            ],
            'code': '370800',
            'name': '济宁市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '371302',
                'name': '兰山区'
              },
              {
                'code': '371311',
                'name': '罗庄区'
              },
              {
                'code': '371312',
                'name': '河东区'
              },
              {
                'code': '371321',
                'name': '沂南县'
              },
              {
                'code': '371322',
                'name': '郯城县'
              },
              {
                'code': '371323',
                'name': '沂水县'
              },
              {
                'code': '371324',
                'name': '苍山县'
              },
              {
                'code': '371325',
                'name': '费县'
              },
              {
                'code': '371326',
                'name': '平邑县'
              },
              {
                'code': '371327',
                'name': '莒南县'
              },
              {
                'code': '371328',
                'name': '蒙阴县'
              },
              {
                'code': '371329',
                'name': '临沭县'
              },
              {
                'code': '371330',
                'name': '其它区'
              }
            ],
            'code': '371300',
            'name': '临沂市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '371202',
                'name': '莱城区'
              },
              {
                'code': '371203',
                'name': '钢城区'
              },
              {
                'code': '371204',
                'name': '其它区'
              }
            ],
            'code': '371200',
            'name': '莱芜市',
            'cityClass': '1'
          }
        ],
        'code': '370000',
        'name': '山东省'
      },
      {
        'city': [
          {
            'county': [
              {
                'code': '410102',
                'name': '中原区'
              },
              {
                'code': '410103',
                'name': '二七区'
              },
              {
                'code': '410104',
                'name': '管城回族区'
              },
              {
                'code': '410105',
                'name': '金水区'
              },
              {
                'code': '410106',
                'name': '上街区'
              },
              {
                'code': '410151',
                'name': '惠济区'
              },
              {
                'code': '410122',
                'name': '中牟县'
              },
              {
                'code': '410181',
                'name': '巩义市'
              },
              {
                'code': '410182',
                'name': '荥阳市'
              },
              {
                'code': '410183',
                'name': '新密市'
              },
              {
                'code': '410184',
                'name': '新郑市'
              },
              {
                'code': '410185',
                'name': '登封市'
              },
              {
                'code': '410186',
                'name': '郑东新区'
              },
              {
                'code': '410187',
                'name': '高新区'
              },
              {
                'code': '410188',
                'name': '其它区'
              }
            ],
            'code': '410100',
            'name': '郑州市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '410202',
                'name': '龙亭区'
              },
              {
                'code': '410203',
                'name': '顺河回族区'
              },
              {
                'code': '410204',
                'name': '鼓楼区'
              },
              {
                'code': '410205',
                'name': '禹王台区'
              },
              {
                'code': '410211',
                'name': '金明区'
              },
              {
                'code': '410221',
                'name': '杞县'
              },
              {
                'code': '410222',
                'name': '通许县'
              },
              {
                'code': '410223',
                'name': '尉氏县'
              },
              {
                'code': '410224',
                'name': '开封县'
              },
              {
                'code': '410225',
                'name': '兰考县'
              },
              {
                'code': '410226',
                'name': '其它区'
              }
            ],
            'code': '410200',
            'name': '开封市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '410302',
                'name': '老城区'
              },
              {
                'code': '410303',
                'name': '西工区'
              },
              {
                'code': '410304',
                'name': '廛河回族区'
              },
              {
                'code': '410305',
                'name': '涧西区'
              },
              {
                'code': '410306',
                'name': '吉利区'
              },
              {
                'code': '410307',
                'name': '洛龙区'
              },
              {
                'code': '410322',
                'name': '孟津县'
              },
              {
                'code': '410323',
                'name': '新安县'
              },
              {
                'code': '410324',
                'name': '栾川县'
              },
              {
                'code': '410325',
                'name': '嵩县'
              },
              {
                'code': '410326',
                'name': '汝阳县'
              },
              {
                'code': '410327',
                'name': '宜阳县'
              },
              {
                'code': '410328',
                'name': '洛宁县'
              },
              {
                'code': '410329',
                'name': '伊川县'
              },
              {
                'code': '410381',
                'name': '偃师市'
              },
              {
                'code': '471004',
                'name': '高新区'
              },
              {
                'code': '471005',
                'name': '其它区'
              }
            ],
            'code': '410300',
            'name': '洛阳市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '410402',
                'name': '新华区'
              },
              {
                'code': '410403',
                'name': '卫东区'
              },
              {
                'code': '410404',
                'name': '石龙区'
              },
              {
                'code': '410411',
                'name': '湛河区'
              },
              {
                'code': '410421',
                'name': '宝丰县'
              },
              {
                'code': '410422',
                'name': '叶县'
              },
              {
                'code': '410423',
                'name': '鲁山县'
              },
              {
                'code': '410425',
                'name': '郏县'
              },
              {
                'code': '410481',
                'name': '舞钢市'
              },
              {
                'code': '410482',
                'name': '汝州市'
              },
              {
                'code': '410483',
                'name': '其它区'
              }
            ],
            'code': '410400',
            'name': '平顶山市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '410502',
                'name': '文峰区'
              },
              {
                'code': '410503',
                'name': '北关区'
              },
              {
                'code': '410506',
                'name': '龙安区'
              },
              {
                'code': '410522',
                'name': '安阳县'
              },
              {
                'code': '410526',
                'name': '滑县'
              },
              {
                'code': '410527',
                'name': '内黄县'
              },
              {
                'code': '410505',
                'name': '殷都区'
              },
              {
                'code': '410523',
                'name': '汤阴县'
              },
              {
                'code': '410581',
                'name': '林州市'
              },
              {
                'code': '410582',
                'name': '其它区'
              }
            ],
            'code': '410500',
            'name': '安阳市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '410602',
                'name': '鹤山区'
              },
              {
                'code': '410611',
                'name': '淇滨区'
              },
              {
                'code': '410621',
                'name': '浚县'
              },
              {
                'code': '410622',
                'name': '淇县'
              },
              {
                'code': '410603',
                'name': '山城区'
              },
              {
                'code': '410623',
                'name': '其它区'
              }
            ],
            'code': '410600',
            'name': '鹤壁市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '410702',
                'name': '红旗区'
              },
              {
                'code': '410703',
                'name': '卫滨区'
              },
              {
                'code': '410704',
                'name': '凤泉区'
              },
              {
                'code': '410711',
                'name': '牧野区'
              },
              {
                'code': '410721',
                'name': '新乡县'
              },
              {
                'code': '410724',
                'name': '获嘉县'
              },
              {
                'code': '410725',
                'name': '原阳县'
              },
              {
                'code': '410726',
                'name': '延津县'
              },
              {
                'code': '410727',
                'name': '封丘县'
              },
              {
                'code': '410728',
                'name': '长垣县'
              },
              {
                'code': '410781',
                'name': '卫辉市'
              },
              {
                'code': '410782',
                'name': '辉县市'
              },
              {
                'code': '410783',
                'name': '其它区'
              }
            ],
            'code': '410700',
            'name': '新乡市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '410823',
                'name': '武陟县'
              },
              {
                'code': '410882',
                'name': '沁阳市'
              },
              {
                'code': '410802',
                'name': '解放区'
              },
              {
                'code': '410803',
                'name': '中站区'
              },
              {
                'code': '410811',
                'name': '山阳区'
              },
              {
                'code': '410821',
                'name': '修武县'
              },
              {
                'code': '410822',
                'name': '博爱县'
              },
              {
                'code': '410825',
                'name': '温县'
              },
              {
                'code': '410883',
                'name': '孟州市'
              },
              {
                'code': '410804',
                'name': '马村区'
              },
              {
                'code': '410884',
                'name': '其它区'
              }
            ],
            'code': '410800',
            'name': '焦作市',
            'cityClass': '1'
          },
          {
            'county': {
              'code': '410881',
              'name': '济源市'
            },
            'code': '410881',
            'name': '济源市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '410902',
                'name': '华龙区'
              },
              {
                'code': '410926',
                'name': '范县'
              },
              {
                'code': '410922',
                'name': '清丰县'
              },
              {
                'code': '410923',
                'name': '南乐县'
              },
              {
                'code': '410927',
                'name': '台前县'
              },
              {
                'code': '410928',
                'name': '濮阳县'
              },
              {
                'code': '410929',
                'name': '其它区'
              }
            ],
            'code': '410900',
            'name': '濮阳市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '411002',
                'name': '魏都区'
              },
              {
                'code': '411023',
                'name': '许昌县'
              },
              {
                'code': '411024',
                'name': '鄢陵县'
              },
              {
                'code': '411025',
                'name': '襄城县'
              },
              {
                'code': '411081',
                'name': '禹州市'
              },
              {
                'code': '411082',
                'name': '长葛市'
              },
              {
                'code': '411083',
                'name': '其它区'
              }
            ],
            'code': '411000',
            'name': '许昌市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '411102',
                'name': '源汇区'
              },
              {
                'code': '411121',
                'name': '舞阳县'
              },
              {
                'code': '411103',
                'name': '郾城区'
              },
              {
                'code': '411104',
                'name': '召陵区'
              },
              {
                'code': '411122',
                'name': '临颍县'
              },
              {
                'code': '411123',
                'name': '其它区'
              }
            ],
            'code': '411100',
            'name': '漯河市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '411202',
                'name': '湖滨区'
              },
              {
                'code': '411224',
                'name': '卢氏县'
              },
              {
                'code': '411221',
                'name': '渑池县'
              },
              {
                'code': '411222',
                'name': '陕县'
              },
              {
                'code': '411281',
                'name': '义马市'
              },
              {
                'code': '411282',
                'name': '灵宝市'
              },
              {
                'code': '411283',
                'name': '其它区'
              }
            ],
            'code': '411200',
            'name': '三门峡市',
            'cityClass': '1'
          },
          {
            'code': '411381',
            'name': '邓州市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '411302',
                'name': '宛城区'
              },
              {
                'code': '411303',
                'name': '卧龙区'
              },
              {
                'code': '411321',
                'name': '南召县'
              },
              {
                'code': '411322',
                'name': '方城县'
              },
              {
                'code': '411323',
                'name': '西峡县'
              },
              {
                'code': '411324',
                'name': '镇平县'
              },
              {
                'code': '411325',
                'name': '内乡县'
              },
              {
                'code': '411326',
                'name': '淅川县'
              },
              {
                'code': '411327',
                'name': '社旗县'
              },
              {
                'code': '411328',
                'name': '唐河县'
              },
              {
                'code': '411329',
                'name': '新野县'
              },
              {
                'code': '411330',
                'name': '桐柏县'
              },
              {
                'code': '411382',
                'name': '其它区'
              }
            ],
            'code': '411300',
            'name': '南阳市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '411402',
                'name': '梁园区'
              },
              {
                'code': '411423',
                'name': '宁陵县'
              },
              {
                'code': '411426',
                'name': '夏邑县'
              },
              {
                'code': '411403',
                'name': '睢阳区'
              },
              {
                'code': '411421',
                'name': '民权县'
              },
              {
                'code': '411422',
                'name': '睢县'
              },
              {
                'code': '411424',
                'name': '柘城县'
              },
              {
                'code': '411425',
                'name': '虞城县'
              },
              {
                'code': '411481',
                'name': '永城市'
              },
              {
                'code': '411482',
                'name': '其它区'
              }
            ],
            'code': '411400',
            'name': '商丘市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '411525',
                'name': '固始县'
              },
              {
                'code': '411528',
                'name': '息县'
              },
              {
                'code': '411502',
                'name': '浉河区'
              },
              {
                'code': '411503',
                'name': '平桥区'
              },
              {
                'code': '411521',
                'name': '罗山县'
              },
              {
                'code': '411523',
                'name': '新县'
              },
              {
                'code': '411524',
                'name': '商城县'
              },
              {
                'code': '411526',
                'name': '潢川县'
              },
              {
                'code': '411527',
                'name': '淮滨县'
              },
              {
                'code': '411529',
                'name': '其它区'
              }
            ],
            'code': '411500',
            'name': '信阳市',
            'cityClass': '1'
          },
          {
            'code': '411522',
            'name': '光山县',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '411602',
                'name': '川汇区'
              },
              {
                'code': '411624',
                'name': '沈丘县'
              },
              {
                'code': '411626',
                'name': '淮阳县'
              },
              {
                'code': '411621',
                'name': '扶沟县'
              },
              {
                'code': '411622',
                'name': '西华县'
              },
              {
                'code': '411623',
                'name': '商水县'
              },
              {
                'code': '411625',
                'name': '郸城县'
              },
              {
                'code': '411627',
                'name': '太康县'
              },
              {
                'code': '411628',
                'name': '鹿邑县'
              },
              {
                'code': '411681',
                'name': '项城市'
              },
              {
                'code': '411682',
                'name': '其它区'
              }
            ],
            'code': '411600',
            'name': '周口市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '411702',
                'name': '驿城区'
              },
              {
                'code': '411721',
                'name': '西平县'
              },
              {
                'code': '411722',
                'name': '上蔡县'
              },
              {
                'code': '411723',
                'name': '平舆县'
              },
              {
                'code': '411724',
                'name': '正阳县'
              },
              {
                'code': '411725',
                'name': '确山县'
              },
              {
                'code': '411726',
                'name': '泌阳县'
              },
              {
                'code': '411727',
                'name': '汝南县'
              },
              {
                'code': '411728',
                'name': '遂平县'
              },
              {
                'code': '411729',
                'name': '新蔡县'
              },
              {
                'code': '411730',
                'name': '其它区'
              }
            ],
            'code': '411700',
            'name': '驻马店市',
            'cityClass': '1'
          }
        ],
        'code': '410000',
        'name': '河南省'
      },
      {
        'city': [
          {
            'county': [
              {
                'code': '420102',
                'name': '江岸区'
              },
              {
                'code': '420103',
                'name': '江汉区'
              },
              {
                'code': '420104',
                'name': '硚口区'
              },
              {
                'code': '420105',
                'name': '汉阳区'
              },
              {
                'code': '420106',
                'name': '武昌区'
              },
              {
                'code': '420107',
                'name': '青山区'
              },
              {
                'code': '420111',
                'name': '洪山区'
              },
              {
                'code': '420112',
                'name': '东西湖区'
              },
              {
                'code': '420113',
                'name': '汉南区'
              },
              {
                'code': '420114',
                'name': '蔡甸区'
              },
              {
                'code': '420115',
                'name': '江夏区'
              },
              {
                'code': '420116',
                'name': '黄陂区'
              },
              {
                'code': '420117',
                'name': '新洲区'
              },
              {
                'code': '420118',
                'name': '其它区'
              }
            ],
            'code': '420100',
            'name': '武汉市',
            'cityClass': '1'
          },
          {
            'code': '429004',
            'name': '仙桃市',
            'cityClass': '1'
          },
          {
            'code': '429005',
            'name': '潜江市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '420202',
                'name': '黄石港区'
              },
              {
                'code': '420222',
                'name': '阳新县'
              },
              {
                'code': '420203',
                'name': '西塞山区'
              },
              {
                'code': '420204',
                'name': '下陆区'
              },
              {
                'code': '420205',
                'name': '铁山区'
              },
              {
                'code': '420281',
                'name': '大冶市'
              },
              {
                'code': '420281',
                'name': '其它区'
              }
            ],
            'code': '420200',
            'name': '黄石市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '420302',
                'name': '茅箭区'
              },
              {
                'code': '420303',
                'name': '张湾区'
              },
              {
                'code': '420321',
                'name': '郧县'
              },
              {
                'code': '420322',
                'name': '郧西县'
              },
              {
                'code': '420323',
                'name': '竹山县'
              },
              {
                'code': '420324',
                'name': '竹溪县'
              },
              {
                'code': '420325',
                'name': '房县'
              },
              {
                'code': '420381',
                'name': '丹江口市'
              },
              {
                'code': '420382',
                'name': '城区'
              },
              {
                'code': '420383',
                'name': '其它区'
              }
            ],
            'code': '420300',
            'name': '十堰市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '420529',
                'name': '五峰土家族自治县'
              },
              {
                'code': '420529',
                'name': '葛洲坝区'
              },
              {
                'code': '420552',
                'name': '葛洲坝区'
              },
              {
                'code': '420581',
                'name': '宜都市'
              },
              {
                'code': '420582',
                'name': '当阳市'
              },
              {
                'code': '420583',
                'name': '枝江市'
              },
              {
                'code': '420503',
                'name': '伍家岗区'
              },
              {
                'code': '420525',
                'name': '远安县'
              },
              {
                'code': '420528',
                'name': '长阳土家族自治县'
              },
              {
                'code': '420502',
                'name': '西陵区'
              },
              {
                'code': '420504',
                'name': '点军区'
              },
              {
                'code': '420505',
                'name': '猇亭区'
              },
              {
                'code': '420506',
                'name': '夷陵区'
              },
              {
                'code': '420526',
                'name': '兴山县'
              },
              {
                'code': '420527',
                'name': '秭归县'
              },
              {
                'code': '420584',
                'name': '其它区'
              }
            ],
            'code': '420500',
            'name': '宜昌市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '420684',
                'name': '宜城市'
              },
              {
                'code': '420602',
                'name': '襄城区'
              },
              {
                'code': '420606',
                'name': '樊城区 '
              },
              {
                'code': '420607',
                'name': '襄阳区'
              },
              {
                'code': '420624',
                'name': '南漳县'
              },
              {
                'code': '420625',
                'name': '谷城县'
              },
              {
                'code': '420626',
                'name': '保康县'
              },
              {
                'code': '420682',
                'name': '老河口市'
              },
              {
                'code': '420683',
                'name': '枣阳市'
              },
              {
                'code': '420685',
                'name': '其它区'
              }
            ],
            'code': '420600',
            'name': '襄阳市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '420702',
                'name': '梁子湖区'
              },
              {
                'code': '420703',
                'name': '华容区'
              },
              {
                'code': '420704',
                'name': '鄂城区'
              },
              {
                'code': '420705',
                'name': '其它区'
              }
            ],
            'code': '420700',
            'name': '鄂州市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '420802',
                'name': '东宝区'
              },
              {
                'code': '420804',
                'name': '掇刀区'
              },
              {
                'code': '420821',
                'name': '京山县'
              },
              {
                'code': '420822',
                'name': '沙洋县'
              },
              {
                'code': '420881',
                'name': '钟祥市'
              },
              {
                'code': '420882',
                'name': '其它区'
              }
            ],
            'code': '420800',
            'name': '荆门市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '420902',
                'name': '孝南区'
              },
              {
                'code': '420921',
                'name': '孝昌县'
              },
              {
                'code': '420922',
                'name': '大悟县'
              },
              {
                'code': '420923',
                'name': '云梦县'
              },
              {
                'code': '420981',
                'name': '应城市'
              },
              {
                'code': '420982',
                'name': '安陆市'
              },
              {
                'code': '420984',
                'name': '汉川市'
              },
              {
                'code': '420985',
                'name': '其它区'
              }
            ],
            'code': '420900',
            'name': '孝感市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '421002',
                'name': '沙市区'
              },
              {
                'code': '421003',
                'name': '荆州区'
              },
              {
                'code': '421022',
                'name': '公安县'
              },
              {
                'code': '421023',
                'name': '监利县'
              },
              {
                'code': '421024',
                'name': '江陵县'
              },
              {
                'code': '421081',
                'name': '石首市'
              },
              {
                'code': '421083',
                'name': '洪湖市'
              },
              {
                'code': '421087',
                'name': '松滋市'
              },
              {
                'code': '421088',
                'name': '其它区'
              }
            ],
            'code': '421000',
            'name': '荆州市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '421102',
                'name': '黄州区'
              },
              {
                'code': '421121',
                'name': '团风县'
              },
              {
                'code': '421122',
                'name': '红安县'
              },
              {
                'code': '421123',
                'name': '罗田县'
              },
              {
                'code': '421124',
                'name': '英山县'
              },
              {
                'code': '421125',
                'name': '浠水县'
              },
              {
                'code': '421126',
                'name': '蕲春县'
              },
              {
                'code': '421127',
                'name': '黄梅县'
              },
              {
                'code': '421181',
                'name': '麻城市'
              },
              {
                'code': '421182',
                'name': '武穴市'
              },
              {
                'code': '421183',
                'name': '其它区'
              }
            ],
            'code': '421100',
            'name': '黄冈市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '421202',
                'name': '咸安区'
              },
              {
                'code': '421221',
                'name': '嘉鱼县'
              },
              {
                'code': '421222',
                'name': '通城县'
              },
              {
                'code': '421223',
                'name': '崇阳县'
              },
              {
                'code': '421224',
                'name': '通山县'
              },
              {
                'code': '421281',
                'name': '赤壁市'
              },
              {
                'code': '421282',
                'name': '温泉城区'
              },
              {
                'code': '421283',
                'name': '其它区'
              }
            ],
            'code': '421200',
            'name': '咸宁市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '421302',
                'name': '曾都区'
              },
              {
                'code': '421381',
                'name': '广水市'
              },
              {
                'code': '421382',
                'name': '其它区'
              }
            ],
            'code': '421300',
            'name': '随州市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '422801',
                'name': '恩施市'
              },
              {
                'code': '422802',
                'name': '利川市'
              },
              {
                'code': '422822',
                'name': '建始县'
              },
              {
                'code': '422823',
                'name': '巴东县'
              },
              {
                'code': '422825',
                'name': '宣恩县'
              },
              {
                'code': '422826',
                'name': '咸丰县'
              },
              {
                'code': '422827',
                'name': '来凤县'
              },
              {
                'code': '422828',
                'name': '鹤峰县'
              },
              {
                'code': '422829',
                'name': '其它区'
              }
            ],
            'code': '422800',
            'name': '恩施土家族苗族自治州',
            'cityClass': '1'
          }
        ],
        'code': '420000',
        'name': '湖北省'
      },
      {
        'city': [
          {
            'county': [
              {
                'code': '430102',
                'name': '芙蓉区'
              },
              {
                'code': '430103',
                'name': '天心区'
              },
              {
                'code': '430104',
                'name': '岳麓区'
              },
              {
                'code': '430105',
                'name': '开福区'
              },
              {
                'code': '430111',
                'name': '雨花区'
              },
              {
                'code': '430121',
                'name': '长沙县'
              },
              {
                'code': '430122',
                'name': '望城县'
              },
              {
                'code': '430124',
                'name': '宁乡县'
              },
              {
                'code': '430181',
                'name': '浏阳市'
              },
              {
                'code': '430182',
                'name': '其它区'
              }
            ],
            'code': '430100',
            'name': '长沙市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '430202',
                'name': '荷塘区'
              },
              {
                'code': '430203',
                'name': '芦淞区'
              },
              {
                'code': '430211',
                'name': '天元区'
              },
              {
                'code': '430221',
                'name': '株洲县'
              },
              {
                'code': '430223',
                'name': '攸县'
              },
              {
                'code': '430225',
                'name': '炎陵县'
              },
              {
                'code': '430281',
                'name': '醴陵市'
              },
              {
                'code': '430204',
                'name': '石峰区'
              },
              {
                'code': '430224',
                'name': '茶陵县'
              },
              {
                'code': '430282',
                'name': '其它区'
              }
            ],
            'code': '430200',
            'name': '株洲市',
            'cityClass': '1'
          },
          {
            'code': '430300',
            'name': '湘潭市',
            'cityClass': '1'
          },
          {
            'code': '430400',
            'name': '衡阳市',
            'cityClass': '1'
          },
          {
            'code': '430500',
            'name': '邵阳市',
            'cityClass': '1'
          },
          {
            'code': '430600',
            'name': '岳阳市',
            'cityClass': '1'
          },
          {
            'code': '430700',
            'name': '常德市',
            'cityClass': '1'
          },
          {
            'code': '431000',
            'name': '株洲市',
            'cityClass': '1'
          },
          {
            'code': '430800',
            'name': '张家界市',
            'cityClass': '1'
          },
          {
            'code': '430900',
            'name': '益阳市',
            'cityClass': '1'
          },
          {
            'code': '431100',
            'name': '永州市',
            'cityClass': '1'
          },
          {
            'code': '431200',
            'name': '怀化市',
            'cityClass': '1'
          },
          {
            'code': '431300',
            'name': '娄底市',
            'cityClass': '1'
          },
          {
            'code': '433101',
            'name': '吉首市',
            'cityClass': '1'
          }
        ],
        'code': '430000',
        'name': '湖南省'
      },
      {
        'city': [
          {
            'county': [
              {
                'code': '440103',
                'name': '荔湾区'
              },
              {
                'code': '440104',
                'name': '越秀区'
              },
              {
                'code': '440105',
                'name': '海珠区'
              },
              {
                'code': '440106',
                'name': '天河区'
              },
              {
                'code': '440111',
                'name': '白云区'
              },
              {
                'code': '440112',
                'name': '黄埔区'
              },
              {
                'code': '440113',
                'name': '番禺区'
              },
              {
                'code': '440114',
                'name': '花都区'
              },
              {
                'code': '440115',
                'name': '南沙区'
              },
              {
                'code': '440116',
                'name': '萝岗区'
              },
              {
                'code': '440183',
                'name': '增城市'
              },
              {
                'code': '440184',
                'name': '从化市'
              },
              {
                'code': '440188',
                'name': '东山区'
              },
              {
                'code': '440189',
                'name': '其它区'
              }
            ],
            'code': '440100',
            'name': '广州市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '440203',
                'name': '武江区'
              },
              {
                'code': '440204',
                'name': '浈江区'
              },
              {
                'code': '440205',
                'name': '曲江区'
              },
              {
                'code': '440222',
                'name': '始兴县'
              },
              {
                'code': '440224',
                'name': '仁化县'
              },
              {
                'code': '440229',
                'name': '翁源县'
              },
              {
                'code': '440232',
                'name': '乳源瑶族自治县'
              },
              {
                'code': '440233',
                'name': '新丰县'
              },
              {
                'code': '440281',
                'name': '乐昌市'
              },
              {
                'code': '440282',
                'name': '南雄市'
              }
            ],
            'code': '440200',
            'name': '韶关市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '440303',
                'name': '罗湖区'
              },
              {
                'code': '440304',
                'name': '福田区'
              },
              {
                'code': '440305',
                'name': '南山区'
              },
              {
                'code': '440306',
                'name': '宝安区'
              },
              {
                'code': '440307',
                'name': '龙岗区'
              },
              {
                'code': '440308',
                'name': '盐田区'
              },
              {
                'code': '440309',
                'name': '其它区'
              }
            ],
            'code': '440300',
            'name': '深圳市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '440402',
                'name': '香洲区'
              },
              {
                'code': '440486',
                'name': '金唐区'
              },
              {
                'code': '440403',
                'name': '斗门区'
              },
              {
                'code': '440404',
                'name': '金湾区'
              },
              {
                'code': '440487',
                'name': '南湾区'
              },
              {
                'code': '440488',
                'name': '其它区'
              }
            ],
            'code': '440400',
            'name': '珠海市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '440507',
                'name': '龙湖区'
              },
              {
                'code': '440514',
                'name': '潮南区'
              },
              {
                'code': '440511',
                'name': '金平区'
              },
              {
                'code': '440512',
                'name': '濠江区'
              },
              {
                'code': '440513',
                'name': '潮阳区'
              },
              {
                'code': '440515',
                'name': '澄海区'
              },
              {
                'code': '440523',
                'name': '南澳县'
              },
              {
                'code': '440524',
                'name': '其它区'
              }
            ],
            'code': '440500',
            'name': '汕头市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '440601',
                'name': '市辖区'
              },
              {
                'code': '440604',
                'name': '禅城区'
              },
              {
                'code': '440605',
                'name': '南海区'
              },
              {
                'code': '440606',
                'name': '顺德区'
              },
              {
                'code': '440607',
                'name': '三水区'
              },
              {
                'code': '440608',
                'name': '高明区'
              }
            ],
            'code': '440600',
            'name': '佛山市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '440703',
                'name': '蓬江区'
              },
              {
                'code': '440705',
                'name': '新会区'
              },
              {
                'code': '440781',
                'name': '台山市'
              },
              {
                'code': '440784',
                'name': '鹤山市'
              },
              {
                'code': '440785',
                'name': '恩平市'
              },
              {
                'code': '440704',
                'name': '江海区'
              },
              {
                'code': '440783',
                'name': '开平市'
              },
              {
                'code': '440786',
                'name': '其它区'
              }
            ],
            'code': '440700',
            'name': '江门市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '440802',
                'name': '赤坎区'
              },
              {
                'code': '440803',
                'name': '霞山区'
              },
              {
                'code': '440804',
                'name': '坡头区'
              },
              {
                'code': '440823',
                'name': '遂溪县'
              },
              {
                'code': '440825',
                'name': '徐闻县'
              },
              {
                'code': '440882',
                'name': '雷州市'
              },
              {
                'code': '440883',
                'name': '吴川市'
              },
              {
                'code': '440811',
                'name': '麻章区'
              },
              {
                'code': '440881',
                'name': '廉江市'
              },
              {
                'code': '440884',
                'name': '其它区'
              }
            ],
            'code': '440800',
            'name': '湛江市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '440902',
                'name': '茂南区'
              },
              {
                'code': '440903',
                'name': '茂港区'
              },
              {
                'code': '440923',
                'name': '电白县'
              },
              {
                'code': '440981',
                'name': '高州市'
              },
              {
                'code': '440982',
                'name': '化州市'
              },
              {
                'code': '440983',
                'name': '信宜市'
              },
              {
                'code': '440984',
                'name': '其它区'
              }
            ],
            'code': '440900',
            'name': '茂名市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '441202',
                'name': '端州区'
              },
              {
                'code': '441223',
                'name': '广宁县'
              },
              {
                'code': '441224',
                'name': '怀集县'
              },
              {
                'code': '441226',
                'name': '德庆县'
              },
              {
                'code': '441283',
                'name': '高要市'
              },
              {
                'code': '441284',
                'name': '四会市'
              },
              {
                'code': '441203',
                'name': '鼎湖区'
              },
              {
                'code': '441225',
                'name': '封开县'
              },
              {
                'code': '441285',
                'name': '其它区'
              }
            ],
            'code': '441200',
            'name': '肇庆市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '441302',
                'name': '惠城区'
              },
              {
                'code': '441322',
                'name': '博罗县'
              },
              {
                'code': '441323',
                'name': '惠东县'
              },
              {
                'code': '441303',
                'name': '惠阳区'
              },
              {
                'code': '441324',
                'name': '龙门县'
              },
              {
                'code': '441325',
                'name': '其它区'
              }
            ],
            'code': '441300',
            'name': '惠州市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '441402',
                'name': '梅江区'
              },
              {
                'code': '441421',
                'name': '梅县'
              },
              {
                'code': '441422',
                'name': '大埔县'
              },
              {
                'code': '441423',
                'name': '丰顺县'
              },
              {
                'code': '441424',
                'name': '五华县'
              },
              {
                'code': '441426',
                'name': '平远县'
              },
              {
                'code': '441427',
                'name': '蕉岭县'
              },
              {
                'code': '441481',
                'name': '兴宁市'
              },
              {
                'code': '441482',
                'name': '其它区'
              }
            ],
            'code': '441400',
            'name': '梅州市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '441502',
                'name': '城区'
              },
              {
                'code': '441521',
                'name': '海丰县'
              },
              {
                'code': '441523',
                'name': '陆河县'
              },
              {
                'code': '441581',
                'name': '陆丰市'
              },
              {
                'code': '441582',
                'name': '其它区'
              }
            ],
            'code': '441500',
            'name': '汕尾市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '441602',
                'name': '源城区'
              },
              {
                'code': '441621',
                'name': '紫金县'
              },
              {
                'code': '441622',
                'name': '龙川县'
              },
              {
                'code': '441623',
                'name': '连平县'
              },
              {
                'code': '441624',
                'name': '和平县'
              },
              {
                'code': '441625',
                'name': '东源县'
              },
              {
                'code': '441626',
                'name': '其它区'
              }
            ],
            'code': '441600',
            'name': '河源市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '441702',
                'name': '江城区'
              },
              {
                'code': '441721',
                'name': '阳西县'
              },
              {
                'code': '441723',
                'name': '阳东县'
              },
              {
                'code': '441781',
                'name': '阳春市'
              },
              {
                'code': '441782',
                'name': '其它区'
              }
            ],
            'code': '441700',
            'name': '阳江市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '441802',
                'name': '清城区'
              },
              {
                'code': '441821',
                'name': '佛冈县'
              },
              {
                'code': '441823',
                'name': '阳山县'
              },
              {
                'code': '441825',
                'name': '连山壮族瑶族自治县'
              },
              {
                'code': '441826',
                'name': '连南瑶族自治县'
              },
              {
                'code': '441827',
                'name': '清新县'
              },
              {
                'code': '441881',
                'name': '英德市'
              },
              {
                'code': '441882',
                'name': '连州市'
              },
              {
                'code': '441883',
                'name': '其它区'
              }
            ],
            'code': '441800',
            'name': '清远市',
            'cityClass': '1'
          },
          {
            'county': {
              'code': '441900',
              'name': '东莞市'
            },
            'code': '441900',
            'name': '东莞市',
            'cityClass': '1'
          },
          {
            'county': {
              'code': '442000',
              'name': '中山市'
            },
            'code': '442000',
            'name': '中山市'
          },
          {
            'county': [
              {
                'code': '445102',
                'name': '湘桥区'
              },
              {
                'code': '445121',
                'name': '潮安县'
              },
              {
                'code': '445122',
                'name': '饶平县'
              },
              {
                'code': '445185',
                'name': '枫溪区'
              },
              {
                'code': '445186',
                'name': '其它区'
              }
            ],
            'code': '445100',
            'name': '潮州市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '445202',
                'name': '中山市'
              },
              {
                'code': '445221',
                'name': '揭西县'
              },
              {
                'code': '445222',
                'name': '揭西县'
              },
              {
                'code': '445224',
                'name': '惠来县'
              },
              {
                'code': '445281',
                'name': '普宁市'
              },
              {
                'code': '445284',
                'name': '东山区'
              },
              {
                'code': '445285',
                'name': '其它区'
              }
            ],
            'code': '445200',
            'name': '揭阳市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '445302',
                'name': '云城区'
              },
              {
                'code': '445321',
                'name': '新兴县'
              },
              {
                'code': '445322',
                'name': '郁南县'
              },
              {
                'code': '445323',
                'name': '云安县'
              },
              {
                'code': '445382',
                'name': '罗定市'
              },
              {
                'code': '445382',
                'name': '其它区'
              }
            ],
            'code': '445300',
            'name': '云浮市',
            'cityClass': '1'
          }
        ],
        'code': '440000',
        'name': '广东省'
      },
      {
        'city': [
          {
            'county': [
              {
                'code': '450102',
                'name': '兴宁区'
              },
              {
                'code': '450103',
                'name': '青秀区'
              },
              {
                'code': '450105',
                'name': '江南区'
              },
              {
                'code': '450108',
                'name': '良庆区'
              },
              {
                'code': '450109',
                'name': '邕宁区'
              },
              {
                'code': '450122',
                'name': '武鸣县'
              },
              {
                'code': '450124',
                'name': '马山县'
              },
              {
                'code': '450125',
                'name': '上林县'
              },
              {
                'code': '450127',
                'name': '横县'
              },
              {
                'code': '450107',
                'name': '西乡塘区'
              },
              {
                'code': '450123',
                'name': '隆安县'
              },
              {
                'code': '450126',
                'name': '宾阳县'
              },
              {
                'code': '450128',
                'name': '其它区'
              }
            ],
            'code': '450100',
            'name': '南宁市',
            'cityClass': '2'
          },
          {
            'code': '450200',
            'name': '柳州市',
            'cityClass': '2'
          },
          {
            'code': '450300',
            'name': '桂林市',
            'cityClass': '2'
          },
          {
            'code': '450400',
            'name': '崇左市',
            'cityClass': '2'
          },
          {
            'code': '450500',
            'name': '来宾市',
            'cityClass': '2'
          },
          {
            'code': '450600',
            'name': '梧州市',
            'cityClass': '2'
          },
          {
            'code': '450700',
            'name': '贺州市',
            'cityClass': '2'
          },
          {
            'code': '450800',
            'name': '玉林市',
            'cityClass': '2'
          },
          {
            'code': '450900',
            'name': '贵港市',
            'cityClass': '2'
          },
          {
            'code': '451000',
            'name': '百色市',
            'cityClass': '2'
          },
          {
            'code': '451100',
            'name': '钦州市',
            'cityClass': '2'
          },
          {
            'code': '451200',
            'name': '河池市',
            'cityClass': '2'
          },
          {
            'code': '451300',
            'name': '北海市',
            'cityClass': '2'
          },
          {
            'code': '451400',
            'name': '防城港市',
            'cityClass': '2'
          }
        ],
        'code': '450000',
        'name': '广西省'
      },
      {
        'city': [
          {
            'county': [
              {
                'code': '460105',
                'name': '秀英区'
              },
              {
                'code': '460106',
                'name': '龙华区'
              },
              {
                'code': '460107',
                'name': '琼山区'
              },
              {
                'code': '460108',
                'name': '美兰区'
              },
              {
                'code': '460109',
                'name': '其它区'
              }
            ],
            'code': '460100',
            'name': '海口市',
            'cityClass': '2'
          },
          {
            'code': '460200',
            'name': '三亚市',
            'cityClass': '2'
          },
          {
            'code': '460300',
            'name': '三沙市',
            'cityClass': '2'
          },
          {
            'code': '460400',
            'name': '儋州市',
            'cityClass': '2'
          }
        ],
        'code': '460000',
        'name': '海南省'
      },
      {
        'city': [
          {
            'county': [
              {
                'code': '500101',
                'name': '万州区'
              },
              {
                'code': '500102',
                'name': '涪陵区'
              },
              {
                'code': '500103',
                'name': '渝中区'
              },
              {
                'code': '500104',
                'name': '大渡口区'
              },
              {
                'code': '500105',
                'name': '江北区'
              },
              {
                'code': '500106',
                'name': '沙坪坝区'
              },
              {
                'code': '500107',
                'name': '九龙坡区'
              },
              {
                'code': '500108',
                'name': '南岸区'
              },
              {
                'code': '500109',
                'name': '北碚区'
              },
              {
                'code': '500110',
                'name': '万盛区'
              },
              {
                'code': '500111',
                'name': '双桥区'
              },
              {
                'code': '500112',
                'name': '渝北区'
              },
              {
                'code': '500113',
                'name': '巴南区'
              },
              {
                'code': '500114',
                'name': '黔江区'
              },
              {
                'code': '500115',
                'name': '长寿区'
              },
              {
                'code': '500122',
                'name': '綦江县'
              },
              {
                'code': '500123',
                'name': '潼南县'
              },
              {
                'code': '500124',
                'name': '铜梁县'
              },
              {
                'code': '500125',
                'name': '大足县'
              },
              {
                'code': '500126',
                'name': '荣昌县'
              },
              {
                'code': '500127',
                'name': '璧山县'
              },
              {
                'code': '500128',
                'name': '梁平县'
              },
              {
                'code': '500129',
                'name': '城口县'
              },
              {
                'code': '500130',
                'name': '丰都县'
              },
              {
                'code': '500131',
                'name': '垫江县'
              },
              {
                'code': '500132',
                'name': '武隆县'
              },
              {
                'code': '500133',
                'name': '忠县'
              },
              {
                'code': '500134',
                'name': '开县'
              },
              {
                'code': '500135',
                'name': '云阳县'
              },
              {
                'code': '500136',
                'name': '奉节县'
              },
              {
                'code': '500137',
                'name': '巫山县'
              },
              {
                'code': '500138',
                'name': '巫溪县'
              },
              {
                'code': '500140',
                'name': '石柱土家族自治县'
              },
              {
                'code': '500141',
                'name': '秀山土家族苗族自治县'
              },
              {
                'code': '500142',
                'name': '酉阳土家族苗族自治县'
              },
              {
                'code': '500143',
                'name': '彭水苗族土家族自治县'
              },
              {
                'code': '500181',
                'name': '江津区'
              },
              {
                'code': '500182',
                'name': '合川区'
              },
              {
                'code': '500183',
                'name': '永川区'
              },
              {
                'code': '500184',
                'name': '南川区'
              },
              {
                'code': '500385',
                'name': '其它区'
              }
            ],
            'code': '500100',
            'name': '重庆市',
            'cityClass': '1'
          }
        ],
        'code': '500000',
        'name': '重庆'
      },
      {
        'city': [
          {
            'county': [
              {
                'code': '510104',
                'name': '锦江区'
              },
              {
                'code': '510105',
                'name': '青羊区'
              },
              {
                'code': '510106',
                'name': '金牛区'
              },
              {
                'code': '510107',
                'name': '武侯区'
              },
              {
                'code': '510108',
                'name': '成华区'
              },
              {
                'code': '510112',
                'name': '龙泉驿区'
              },
              {
                'code': '510113',
                'name': '青白江区'
              },
              {
                'code': '510114',
                'name': '新都区'
              },
              {
                'code': '510115',
                'name': '温江区'
              },
              {
                'code': '510121',
                'name': '金堂县'
              },
              {
                'code': '510122',
                'name': '双流县'
              },
              {
                'code': '510124',
                'name': '郫县'
              },
              {
                'code': '510129',
                'name': '大邑县'
              },
              {
                'code': '510131',
                'name': '蒲江县'
              },
              {
                'code': '510132',
                'name': '新津县'
              },
              {
                'code': '510181',
                'name': '都江堰市'
              },
              {
                'code': '510182',
                'name': '彭州市'
              },
              {
                'code': '510183',
                'name': '邛崃市'
              },
              {
                'code': '510184',
                'name': '崇州市'
              },
              {
                'code': '510185',
                'name': '其它区'
              }
            ],
            'code': '510100',
            'name': '成都市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '510603',
                'name': '旌阳区'
              },
              {
                'code': '510623',
                'name': '中江县'
              },
              {
                'code': '510626',
                'name': '罗江县'
              },
              {
                'code': '510681',
                'name': '广汉市'
              },
              {
                'code': '510682',
                'name': '什邡市'
              },
              {
                'code': '510683',
                'name': '绵竹市'
              },
              {
                'code': '510684',
                'name': '其它区'
              }
            ],
            'code': '510600',
            'name': '德阳市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '510703',
                'name': '涪城区'
              },
              {
                'code': '510704',
                'name': '游仙区'
              },
              {
                'code': '510722',
                'name': '三台县'
              },
              {
                'code': '510723',
                'name': '盐亭县'
              },
              {
                'code': '510724',
                'name': '安县'
              },
              {
                'code': '510725',
                'name': '梓潼县'
              },
              {
                'code': '510726',
                'name': '北川羌族自治县'
              },
              {
                'code': '510727',
                'name': '平武县'
              },
              {
                'code': '510751',
                'name': '高新区'
              },
              {
                'code': '510781',
                'name': '江油市'
              },
              {
                'code': '510782',
                'name': '其它区'
              }
            ],
            'code': '510700',
            'name': '绵阳市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '510302',
                'name': '自流井区'
              },
              {
                'code': '510303',
                'name': '贡井区'
              },
              {
                'code': '510304',
                'name': '大安区'
              },
              {
                'code': '510311',
                'name': '沿滩区'
              },
              {
                'code': '510321',
                'name': '荣县'
              },
              {
                'code': '510322',
                'name': '富顺县'
              },
              {
                'code': '510323',
                'name': '其它区'
              }
            ],
            'code': '510300',
            'name': '自贡市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '511102',
                'name': '市中区'
              },
              {
                'code': '511111',
                'name': '沙湾区'
              },
              {
                'code': '511112',
                'name': '五通桥区'
              },
              {
                'code': '511113',
                'name': '金口河区'
              },
              {
                'code': '511123',
                'name': '犍为县'
              },
              {
                'code': '511124',
                'name': '井研县'
              },
              {
                'code': '511126',
                'name': '夹江县'
              },
              {
                'code': '511129',
                'name': '沐川县'
              },
              {
                'code': '511132',
                'name': '峨边彝族自治县'
              },
              {
                'code': '511133',
                'name': '马边彝族自治县'
              },
              {
                'code': '511181',
                'name': '峨眉山市'
              },
              {
                'code': '511182',
                'name': '其它区'
              }
            ],
            'code': '511100',
            'name': '乐山市',
            'cityClass': '1'
          },
          {
            'code': '510200',
            'name': '攀枝花市',
            'cityClass': '1'
          },
          {
            'code': '510400',
            'name': '南充市',
            'cityClass': '1'
          },
          {
            'code': '510500',
            'name': '广元市',
            'cityClass': '1'
          },
          {
            'code': '510800',
            'name': '宜宾市',
            'cityClass': '1'
          },
          {
            'code': '510900',
            'name': '泸州市',
            'cityClass': '1'
          },
          {
            'code': '511000',
            'name': '达州市',
            'cityClass': '1'
          },
          {
            'code': '511200',
            'name': '广安市',
            'cityClass': '1'
          },
          {
            'code': '511300',
            'name': '巴中市',
            'cityClass': '1'
          },
          {
            'code': '511400',
            'name': '雅安市',
            'cityClass': '1'
          },
          {
            'code': '511500',
            'name': '内江市',
            'cityClass': '1'
          },
          {
            'code': '511600',
            'name': '资阳市',
            'cityClass': '1'
          },
          {
            'code': '511700',
            'name': '眉山市',
            'cityClass': '1'
          }
        ],
        'code': '510000',
        'name': '四川省'
      },
      {
        'city': [
          {
            'county': [
              {
                'code': '520102',
                'name': '南明区'
              },
              {
                'code': '520111',
                'name': '花溪区'
              },
              {
                'code': '520112',
                'name': '乌当区'
              },
              {
                'code': '520113',
                'name': '白云区'
              },
              {
                'code': '520121',
                'name': '开阳县'
              },
              {
                'code': '520122',
                'name': '息烽县'
              },
              {
                'code': '520151',
                'name': '金阳开发区'
              },
              {
                'code': '520181',
                'name': '清镇市'
              },
              {
                'code': '520103',
                'name': '云岩区'
              },
              {
                'code': '520114',
                'name': '小河区'
              },
              {
                'code': '520123',
                'name': '修文县'
              },
              {
                'code': '520182',
                'name': '其它区'
              }
            ],
            'code': '520100',
            'name': '贵阳市',
            'cityClass': '2'
          },
          {
            'code': '520200',
            'name': '遵义',
            'cityClass': '1'
          },
          {
            'code': '520300',
            'name': '六盘水',
            'cityClass': '1'
          },
          {
            'code': '520400',
            'name': '安顺',
            'cityClass': '1'
          },
          {
            'code': '520500',
            'name': '毕节',
            'cityClass': '1'
          },
          {
            'code': '520600',
            'name': '铜仁',
            'cityClass': '1'
          }
        ],
        'code': '520000',
        'name': '贵州省'
      },
      {
        'city': [
          {
            'county': [
              {
                'code': '530102',
                'name': '五华区'
              },
              {
                'code': '530103',
                'name': '盘龙区'
              },
              {
                'code': '530111',
                'name': '官渡区'
              },
              {
                'code': '530112',
                'name': '西山区'
              },
              {
                'code': '530113',
                'name': '东川区'
              },
              {
                'code': '530121',
                'name': '呈贡县'
              },
              {
                'code': '530122',
                'name': '晋宁县'
              },
              {
                'code': '530124',
                'name': '富民县'
              },
              {
                'code': '530125',
                'name': '宜良县'
              },
              {
                'code': '530126',
                'name': '石林彝族自治县'
              },
              {
                'code': '530127',
                'name': '嵩明县'
              },
              {
                'code': '530128',
                'name': '禄劝彝族苗族自治县'
              },
              {
                'code': '530129',
                'name': '寻甸回族彝族自治县'
              },
              {
                'code': '530181',
                'name': '安宁市'
              },
              {
                'code': '530182',
                'name': '其它区'
              }
            ],
            'code': '530100',
            'name': '昆明市',
            'cityClass': '1'
          },
          {
            'code': '530200',
            'name': '曲靖市',
            'cityClass': '1'
          },
          {
            'code': '530300',
            'name': '玉溪市',
            'cityClass': '1'
          },
          {
            'code': '530400',
            'name': '昭通市',
            'cityClass': '1'
          },
          {
            'code': '530500',
            'name': '保山市',
            'cityClass': '1'
          },
          {
            'code': '530600',
            'name': '丽江市',
            'cityClass': '1'
          },
          {
            'code': '530700',
            'name': '普洱市',
            'cityClass': '1'
          },
          {
            'code': '530800',
            'name': '临沧市',
            'cityClass': '1'
          }
        ],
        'code': '530000',
        'name': '云南省'
      },
      {
        'city': [
          {
            'county': [
              {
                'code': '540102',
                'name': '城关区'
              },
              {
                'code': '540121',
                'name': '林周县'
              },
              {
                'code': '540123',
                'name': '尼木县'
              },
              {
                'code': '540124',
                'name': '曲水县'
              },
              {
                'code': '540126',
                'name': '达孜县'
              },
              {
                'code': '540127',
                'name': '墨竹工卡县'
              },
              {
                'code': '540122',
                'name': '当雄县'
              },
              {
                'code': '540125',
                'name': '堆龙德庆县'
              },
              {
                'code': '540128',
                'name': '其它区'
              }
            ],
            'code': '540100',
            'name': '拉萨市',
            'cityClass': '2'
          },
          {
            'code': '540200',
            'name': '日喀则市',
            'cityClass': '1'
          },
          {
            'code': '540300',
            'name': '昌都市',
            'cityClass': '1'
          },
          {
            'code': '540400',
            'name': '林芝市',
            'cityClass': '1'
          },
          {
            'code': '540500',
            'name': '山南市',
            'cityClass': '1'
          },
          {
            'code': '540600',
            'name': '那曲市',
            'cityClass': '1'
          }
        ],
        'code': '540000',
        'name': '西藏省'
      },
      {
        'city': [
          {
            'county': [
              {
                'code': '610102',
                'name': '新城区'
              },
              {
                'code': '610103',
                'name': '碑林区'
              },
              {
                'code': '610104',
                'name': '莲湖区'
              },
              {
                'code': '610111',
                'name': '灞桥区'
              },
              {
                'code': '610112',
                'name': '未央区'
              },
              {
                'code': '610113',
                'name': '雁塔区'
              },
              {
                'code': '610114',
                'name': '阎良区'
              },
              {
                'code': '610115',
                'name': '临潼区'
              },
              {
                'code': '610116',
                'name': '长安区'
              },
              {
                'code': '610122',
                'name': '蓝田县'
              },
              {
                'code': '610124',
                'name': '周至县'
              },
              {
                'code': '610125',
                'name': '户县'
              },
              {
                'code': '610126',
                'name': '高陵县'
              },
              {
                'code': '610127',
                'name': '其它区'
              }
            ],
            'code': '610100',
            'name': '西安市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '610302',
                'name': '渭滨区'
              },
              {
                'code': '610303',
                'name': '金台区'
              },
              {
                'code': '610322',
                'name': '凤翔县'
              },
              {
                'code': '610323',
                'name': '岐山县'
              },
              {
                'code': '610326',
                'name': '眉县'
              },
              {
                'code': '610327',
                'name': '陇县'
              },
              {
                'code': '610328',
                'name': '千阳县'
              },
              {
                'code': '610330',
                'name': '凤县'
              },
              {
                'code': '610331',
                'name': '太白县'
              },
              {
                'code': '610304',
                'name': '陈仓区'
              },
              {
                'code': '610324',
                'name': '扶风县'
              },
              {
                'code': '610329',
                'name': '麟游县'
              },
              {
                'code': '610332',
                'name': '其它区'
              }
            ],
            'code': '610300',
            'name': '宝鸡市',
            'cityClass': '1'
          },
          {
            'county': [
              {
                'code': '610402',
                'name': '秦都区'
              },
              {
                'code': '610403',
                'name': '杨凌区'
              },
              {
                'code': '610422',
                'name': '三原县'
              },
              {
                'code': '610423',
                'name': '泾阳县'
              },
              {
                'code': '610425',
                'name': '礼泉县'
              },
              {
                'code': '610426',
                'name': '永寿县'
              },
              {
                'code': '610428',
                'name': '长武县'
              },
              {
                'code': '610429',
                'name': '旬邑县'
              },
              {
                'code': '610431',
                'name': '武功县'
              },
              {
                'code': '610481',
                'name': '兴平市'
              },
              {
                'code': '610404',
                'name': '渭城区'
              },
              {
                'code': '610424',
                'name': '乾县'
              },
              {
                'code': '610427',
                'name': '彬县'
              },
              {
                'code': '610430',
                'name': '淳化县'
              },
              {
                'code': '610482',
                'name': '其它区'
              }
            ],
            'code': '610400',
            'name': '咸阳市',
            'cityClass': '1'
          },
          {
            'code': '610900',
            'name': '安康市',
            'cityClass': '1'
          },
          {
            'code': '610200',
            'name': '铜川市',
            'cityClass': '1'
          },
          {
            'code': '610500',
            'name': '渭南市',
            'cityClass': '1'
          },
          {
            'code': '610600',
            'name': '延安市',
            'cityClass': '1'
          },
          {
            'code': '610700',
            'name': '榆林市',
            'cityClass': '1'
          },
          {
            'code': '610800',
            'name': '汉中市',
            'cityClass': '1'
          },
          {
            'code': '610900',
            'name': '商洛市',
            'cityClass': '1'
          }
        ],
        'code': '610000',
        'name': '陕西省'
      },
      {
        'city': [
          {
            'county': [
              {
                'code': '620102',
                'name': '城关区'
              },
              {
                'code': '620103',
                'name': '七里河区'
              },
              {
                'code': '620104',
                'name': '西固区'
              },
              {
                'code': '620105',
                'name': '安宁区'
              },
              {
                'code': '620111',
                'name': '红古区'
              },
              {
                'code': '620121',
                'name': '永登县'
              },
              {
                'code': '620122',
                'name': '皋兰县'
              },
              {
                'code': '620123',
                'name': '榆中县'
              },
              {
                'code': '620124',
                'name': '其它区'
              }
            ],
            'code': '620100',
            'name': '兰州市',
            'cityClass': '2'
          },
          {
            'code': '620200',
            'name': '嘉峪关市',
            'cityClass': '1'
          },
          {
            'code': '620300',
            'name': '金昌市',
            'cityClass': '1'
          },
          {
            'code': '620400',
            'name': '白银市',
            'cityClass': '1'
          },
          {
            'code': '620500',
            'name': '天水市',
            'cityClass': '1'
          },
          {
            'code': '620600',
            'name': '武威市',
            'cityClass': '1'
          },
          {
            'code': '620700',
            'name': '张掖市',
            'cityClass': '1'
          },
          {
            'code': '620800',
            'name': '平凉市',
            'cityClass': '1'
          },
          {
            'code': '620900',
            'name': '酒泉市',
            'cityClass': '1'
          },
          {
            'code': '620100',
            'name': '庆阳市',
            'cityClass': '1'
          },
          {
            'code': '620110',
            'name': '定西市',
            'cityClass': '1'
          },
          {
            'code': '620120',
            'name': '陇南市 ',
            'cityClass': '1'
          }
        ],
        'code': '620000',
        'name': '甘肃省'
      },
      {
        'city': [
          {
            'county': [
              {
                'code': '630102',
                'name': '城东区'
              },
              {
                'code': '630103',
                'name': '城中区'
              },
              {
                'code': '630104',
                'name': '城西区'
              },
              {
                'code': '630105',
                'name': '城北区'
              },
              {
                'code': '630121',
                'name': '大通回族土族自治县'
              },
              {
                'code': '630122',
                'name': '湟中县'
              },
              {
                'code': '630123',
                'name': '湟源县'
              },
              {
                'code': '630124',
                'name': '其它区'
              }
            ],
            'code': '630100',
            'name': '西宁市',
            'cityClass': '2'
          },
          {
            'code': '630200',
            'name': '海东市',
            'cityClass': '1'
          },
          {
            'code': '630300',
            'name': '德令哈市',
            'cityClass': '1'
          },
          {
            'code': '630400',
            'name': '格尔木市',
            'cityClass': '1'
          },
          {
            'code': '630500',
            'name': '玉树市 ',
            'cityClass': '1'
          }
        ],
        'code': '630000',
        'name': '青海省'
      },
      {
        'city': [
          {
            'county': [
              {
                'code': '640104',
                'name': '兴庆区'
              },
              {
                'code': '640105',
                'name': '西夏区'
              },
              {
                'code': '640106',
                'name': '金凤区'
              },
              {
                'code': '640122',
                'name': '贺兰县'
              },
              {
                'code': '640181',
                'name': '灵武市'
              },
              {
                'code': '640121',
                'name': '永宁县'
              },
              {
                'code': '640182',
                'name': '其它区'
              }
            ],
            'code': '640100',
            'name': '银川市',
            'cityClass': '2'
          },
          {
            'code': '640200',
            'name': '石嘴山市 ',
            'cityClass': '1'
          },
          {
            'code': '640300',
            'name': '吴忠市 ',
            'cityClass': '1'
          },
          {
            'code': '640400',
            'name': '固原市 ',
            'cityClass': '1'
          },
          {
            'code': '640500',
            'name': '中卫市 ',
            'cityClass': '1'
          }
        ],
        'code': '640000',
        'name': '宁夏省'
      },
      {
        'city': [
          {
            'county': [
              {
                'code': '650102',
                'name': '天山区'
              },
              {
                'code': '650103',
                'name': '沙依巴克区'
              },
              {
                'code': '650104',
                'name': '新市区'
              },
              {
                'code': '650106',
                'name': '头屯河区'
              },
              {
                'code': '650107',
                'name': '达坂城区'
              },
              {
                'code': '650109',
                'name': '米东区'
              },
              {
                'code': '650121',
                'name': '乌鲁木齐县'
              },
              {
                'code': '650105',
                'name': '水磨沟区'
              },
              {
                'code': '650108',
                'name': '东山区'
              },
              {
                'code': '650122',
                'name': '其它区'
              }
            ],
            'code': '650100',
            'name': '乌鲁木齐市',
            'cityClass': '2'
          },
          {
            'code': '650200',
            'name': '克拉玛依市 ',
            'cityClass': '1'
          },
          {
            'code': '650300',
            'name': '吐鲁番市 ',
            'cityClass': '1'
          },
          {
            'code': '650400',
            'name': '哈密市 ',
            'cityClass': '1'
          }
        ],
        'code': '650000',
        'name': '新疆省'
      }
    ]
  }
  